
//функции работы с edost
var cit = new Array("Абаза", "Абакан", "Абдулино", "Абинск", "Автуры", "Агидель", "Агрыз", "Азнакаево", "Азов", "Айхал", "Акбулак", "Аксай", "Алагир", "Алапаевск", "Алатырь", "Алдан", "Алейск", "Александров", "Александровск", "Александровское", "Алексеевка", "Алексин", "Алушта", "Альметьевск", "Амурск", "Анадырь", "Анапа", "Ангарск", "Анжеро-Судженск", "Анна", "Апатиты", "Апрелевка", "Апшеронск", "Арамиль", "Аргун", "Ардон", "Арзамас", "Арзгир", "Аркадак", "Армавир", "Армянск", "Арсеньев", "Арск", "Артем", "Артемовский", "Архангельск", "Асбест", "Асино", "Астрахань", "Аткарск", "Афипский", "Ахтубинск", "Ахтырский", "Ачинск", "Ачхой-Мартан", "Аша", "Бавлы", "Багаевская", "Байкальск", "Байконур", "Баймак", "Бакал", "Баксан", "Балабаново", "Балаково", "Балахна", "Балашиха", "Балашов", "Балезино", "Балей", "Балтийск", "Барабинск", "Барнаул", "Барыш", "Батайск", "Бахчисарай", "Бачатский", "Бачи-Юрт", "Бежецк", "Безенчук", "Белая Глина", "Белая Калитва", "Белгород", "Белебей", "Белев", "Белово", "Белогорск", "Белокуриха", "Белоозерский", "Белорецк", "Белореченск", "Белоярский", "Белый Яр", "Бердск", "Березники", "Березовка", "Березовский (Кемеровская область)", "Березовский (Свердловская область)", "Беслан", "Бийск", "Бикин", "Биробиджан", "Бирск", "Благовещенск (Амурская область)", "Благовещенск (Республика Башкортостан)", "Благодарный", "Бобров", "Богданович", "Богородицк", "Богородск", "Боготол", "Бодайбо", "Бокситогорск", "Бологое", "Болотное", "Большой Камень", "Бор", "Борзя", "Борисовка", "Борисоглебск", "Боровичи", "Боровский", "Бородино", "Братск", "Бронницы", "Брюховецкая", "Брянск", "Бугульма", "Бугуруслан", "Буденновск", "Бузулук", "Буинск", "Буй", "Буйнакск", "Бутурлиновка", "Валдай", "Валуйки", "Ванино", "Варениковская", "Васильево", "Великие Луки", "Великий Новгород", "Великий Устюг", "Вельск", "Венев", "Верещагино", "Верхнеднепровский", "Верхний Уфалей", "Верхняя Пышма", "Верхняя Салда", "Видное", "Вилючинск", "Вихоревка", "Вичуга", "Владивосток", "Владикавказ", "Владимир", "Внуково", "Волгоград", "Волгодонск", "Волгореченск", "Волжск", "Волжский", "Вологда", "Волоколамск", "Волхов", "Вольск", "Воргашор", "Воркута", "Воронеж", "Воскресенск", "Востряково", "Воткинск", "Врангель", "Всеволожск", "Вуктыл", "Выборг", "Выкса", "Выселки", "Вышний Волочек", "Вяземский", "Вязники", "Вязьма", "Вятские Поляны", "Гаврилов-Ям", "Гагарин", "Гай", "Галич", "Гатчина", "Гвардейск", "Геленджик", "Георгиевск", "Гиагинская", "Глазов", "Голицыно", "Горно-Алтайск", "Горняк (Алтайский край)", "Горняк (Челябинская область)", "Городец", "Городище", "Гороховец", "Горьковский", "Горячеводский", "Горячий ключ", "Грамотеино", "Грибановский", "Грозный", "Грязи", "Грязовец", "Губаха", "Губкин", "Губкинский", "Гудермес", "Гуково", "Гулькевичи", "Гурьевск", "Гусев", "Гусиноозерск", "Гусь-Хрустальный", "Давлеканово", "Дагестанские Огни", "Далматово", "Дальнегорск", "Дальнереченск", "Данилов", "Данков", "Дегтярск", "Дедовск", "Дербент", "Десногорск", "Джалиль", "Джанкой", "Дзержинск", "Дзержинский", "Дивногорск", "Дивное", "Димитровград", "Динская", "Дмитров", "Добрянка", "Долгопрудный", "Домодедово", "Донецк", "Донское", "Донской", "Дубна", "Дубовка", "Дугулубгей", "Дудинка", "Дюртюли", "Дятьково", "Евпатория", "Егорлыкская", "Егорьевск", "Ейск", "Екатеринбург", "Елабуга", "Елань", "Елец", "Елизаветинская", "Елизово", "Еманжелинск", "Емва", "Енисейск", "Ершов", "Ессентуки", "Ессентукская", "Ефремов", "Железноводск", "Железногорск (Красноярский край)", "Железногорск (Курская область)", "Железногорск-Илимский", "Железнодорожный", "Жердевка", "Жигулевск", "Жирновск", "Жуковка", "Жуковский", "Завитинск", "Заводоуковск", "Заводской (Приморский край)", "Заводской (Республика Северная Осетия - Алания)", "Заволжье", "Заинск", "Заполярный", "Зарайск", "Заречный (Пензенская область)", "Заречный (Свердловская область)", "Заринск", "Зверево", "Зеленогорск", "Зеленоград", "Зеленодольск", "Зеленокумск", "Зеленчукская", "Зерноград", "Зея", "Зима", "Зимовники", "Златоуст", "Знаменск", "Иваново", "Ивантеевка", "Ивдель", "Игра", "Ижевск", "Избербаш", "Излучинск", "Изобильный", "Иланский", "Ильский", "Инза", "Иноземцево", "Инта", "Ипатово", "Ирбит", "Иркутск", "Исилькуль", "Искитим", "Истра", "Ишим", "Ишимбай", "Йошкар-Ола", "Кавалерово", "Казань", "Кайеркан", "Калач", "Калач-на-Дону", "Калачинск", "Калининград", "Калининец", "Калинино", "Калининск", "Калтан", "Калуга", "Калязин", "Каменка", "Каменск-Уральский", "Каменск-Шахтинский", "Камень-на-Оби", "Камешково", "Камские Поляны", "Камызяк", "Камышин", "Камышлов", "Канаш", "Кандалакша", "Каневская", "Канск", "Кантышево", "Карабаново", "Карабаш", "Карабулак", "Карасук", "Карачаевск", "Карачев", "Карпинск", "Карталы", "Касимов", "Касли", "Каспийск", "Катав-Ивановск", "Катайск", "Качканар", "Кашин", "Кашира", "Кедровка", "Кемерово", "Кемь", "Керчь", "Кизел", "Кизилюрт", "Кизляр", "Кимовск", "Кимры", "Кингисепп", "Кинель", "Кинель-Черкассы", "Кинешма", "Киреевск", "Киржач", "Кириши", "Киров (Калужская область)", "Киров (Кировская область)", "Кировград", "Кирово-Чепецк", "Кировск (Ленинградская область)", "Кировск (Мурманская область)", "Кирсанов", "Киселевск", "Кисловодск", "Климово", "Климовск", "Клин", "Клинцы", "Ковдор", "Ковров", "Ковылкино", "Когалым", "Кодинск", "Козельск", "Козьмодемьянск", "Коломна", "Колпашево", "Колпино", "Кольцово", "Кольчугино", "Коммунар", "Комсомольск-на-Амуре", "Комсомольский", "Конаково", "Кондопога", "Кондрово", "Константиновск", "Копейск", "Кораблино", "Кореновск", "Коркино", "Королев", "Корсаков", "Коряжма", "Косая Гора", "Костомукша", "Кострома", "Котельники", "Котельниково", "Котельнич", "Котлас", "Котово", "Котовск", "Кохма", "Коченево", "Кочубеевское", "Красноармейск (Московская область)", "Красноармейск (Саратовская область)", "Красновишерск", "Красногвардейское", "Красногорск", "Краснодар", "Красное Село", "Краснознаменск", "Краснокаменск", "Краснокамск", "Краснообск", "Красноперекопск", "Краснослободск", "Краснотурьинск", "Красноуральск", "Красноуфимск", "Красноярск", "Красный Кут", "Красный Сулин", "Кропоткин", "Крыловская", "Крымск", "Крюково", "Кстово", "Кубинка", "Кувандык", "Кудымкар", "Кузнецк", "Куйбышев", "Кукмор", "Кулебаки", "Кулешовка", "Кулунда", "Кумертау", "Кунгур", "Купино", "Курагино", "Курган", "Курганинск", "Куровское", "Курск", "Куртамыш", "Курчалой", "Курчатов", "Куса", "Кушва", "Кущевская", "Кызыл", "Кыштым", "Кяхта", "Лабинск", "Лабытнанги", "Лагань", "Ладожская", "Лакинск", "Лангепас", "Лебедянь", "Ленинградская", "Лениногорск", "Ленинск", "Ленинск-Кузнецкий", "Ленск", "Лермонтов", "Лесной", "Лесозаводск", "Лесосибирск", "Ливны", "Ликино-Дулево", "Линево", "Липецк", "Лиски", "Лобня", "Лодейное Поле", "Лопатинский", "Лосино-Петровский", "Луга", "Луховицы", "Лучегорск", "Лысково", "Лысьва", "Лыткарино", "Льгов", "Люберцы", "Людиново", "Лянтор", "Магадан", "Магас", "Магнитогорск", "Майкоп", "Майма", "Майский", "Малаховка", "Малая Вишера", "Малгобек", "Малоярославец", "Мантурово", "Мариинск", "Маркс", "Матвеев Курган", "Махачкала", "Мегион", "Медведево", "Медведовская", "Медвежьегорск", "Медногорск", "Межгорье", "Междуреченск", "Меленки", "Мелеуз", "Менделеевск", "Мензелинск", "Металлострой", "Миасс", "Миллерово", "Минеральные Воды", "Минусинск", "Мирный (Архангельская область)", "Мирный (Республика Саха (Якутия))", "Михайловка", "Михайловск", "Мичуринск", "Можайск", "Можга", "Моздок", "Монино", "Мончегорск", "Морозовск", "Моршанск", "Москва", "Московский", "Мостовской", "Муравленко", "Мурманск", "Мурмаши", "Муром", "Мценск", "Мыски", "Мытищи", "Набережные Челны", "Навашино", "Навля", "Надым", "Назарово", "Назрань", "Нальчик", "Наро-Фоминск", "Нарткала", "Нарьян-Мар", "Нахабино", "Находка", "Невель", "Невельск", "Невинномысск", "Невьянск", "Незлобная", "Нелидово", "Нерехта", "Нерчинск", "Нерюнгри", "Нестеровская", "Нефтегорск", "Нефтекамск", "Нефтекумск", "Нефтеюганск", "Нижневартовск", "Нижнекамск", "Нижнеудинск", "Нижний Ломов", "Нижний Новгород", "Нижний Тагил", "Нижняя Салда", "Нижняя Тура", "Никель", "Николаевск", "Николаевск-на-Амуре", "Никольск", "Никольско-Архангельский", "Никольское", "Новая Ляля", "Новая Усмань", "Новоалександровск", "Новоалтайск", "Новоаннинский", "Нововоронеж", "Новодвинск", "Новозыбков", "Новокубанск", "Новокузнецк", "Новокуйбышевск", "Новомичуринск", "Новомосковск", "Новопавловск", "Новопокровская", "Новороссийск", "Новосибирск", "Новосиликатный", "Новосинеглазовский", "Новотитаровская", "Новотроицк", "Новоузенск", "Новоульяновск", "Новоуральск", "Новочебоксарск", "Новочеркасск", "Новошахтинск", "Новый Городок", "Новый Оскол", "Новый Уренгой", "Ногинск", "Норильск", "Ноябрьск", "Нурлат", "Нытва", "Нягань", "Няндома", "Обнинск", "Обоянь", "Обь", "Одинцово", "Озерск", "Озеры", "Октябрьск", "Октябрьский", "Окуловка", "Оленегорск", "Омск", "Омутнинск", "Онега", "Орджоникидзевская", "Орел", "Оренбург", "Орехово-Зуево", "Орловский", "Орск", "Оса", "Осинники", "Осташков", "Остров", "Острогожск", "Отрадная", "Отрадное", "Отрадный", "Оха", "Очер", "Павлово", "Павловск (Алтайский край)", "Павловск (Воронежская область)", "Павловск (Ленинградская область)", "Павловская", "Павловский Посад", "Палласовка", "Партизанск", "Пашковский", "Пенза", "Первомайск", "Первоуральск", "Пересвет", "Переславль-Залесский", "Пермь", "Персиановский", "Пестово", "Петергоф", "Петров Вал", "Петровск", "Петровск-Забайкальский", "Петрозаводск", "Петропавловск-Камчатский", "Петушки", "Печора", "Пикалево", "Плавск", "Пласт", "Поворино", "Подольск", "Подпорожье", "Пойковский", "Покачи", "Покров", "Полевской", "Полтавская", "Полысаево", "Полярные Зори", "Полярный", "Поронайск", "Похвистнево", "Почеп", "Приволжск", "Приволжский", "Придонской", "Приморско-Ахтарск", "Приозерск", "Приютово", "Прокопьевск", "Пролетарск", "Промышленная", "Протвино", "Прохладный", "Псков", "Пугачев", "Пушкин", "Пушкино", "Пущино", "Пыть-Ях", "Пятигорск", "Радужный (Владимирская область)", "Радужный (Ханты-Мансийский автономный округ)", "Раевский", "Разумное", "Райчихинск", "Раменское", "Рассказово", "Ревда", "Реж", "Реутов", "Рефтинский", "Ржев", "Родники", "Роза", "Рославль", "Россошь", "Ростов", "Ростов-на-Дону", "Рошаль", "Ртищево", "Рубцовск", "Рузаевка", "Рыбинск", "Рыбное", "Рыльск", "Ряжск", "Рязань", "Саки", "Салават", "Салехард", "Сальск", "Самара", "Санкт-Петербург", "Саракташ", "Саранск", "Сарапул", "Саратов", "Саров", "Сасово", "Сатка", "Сафоново", "Саяногорск", "Саянск", "Светлоград", "Светлый", "Светогорск", "Свирск", "Свободный", "Свободы", "Севастополь", "Северо-Задонск", "Северобайкальск", "Северодвинск", "Североморск", "Североуральск", "Северск", "Северская", "Сегежа", "Селенгинск", "Сельцо", "Семенов", "Семикаракорск", "Семилуки", "Сергач", "Сергиев Посад", "Сердобск", "Серов", "Серпухов", "Сертолово", "Сестрорецк", "Сибай", "Сим", "Симферополь", "Скопин", "Славгород", "Славянка", "Славянск-на-Кубани", "Сланцы", "Слободской", "Слюдянка", "Смоленск", "Снежинск", "Собинка", "Советск (Калининградская область)", "Советск (Кировская область)", "Советская Гавань", "Советский", "Сокол", "Соликамск", "Солнечногорск", "Солнечный", "Соль-Илецк", "Сорочинск", "Сортавала", "Сосновоборск", "Сосновый Бор", "Сосногорск", "Софрино", "Сочи", "Спасск-Дальний", "Среднеуральск", "Ставрополь", "Старая Купавна", "Старая Русса", "Стародуб", "Староминская", "Старощербиновская", "Старый Оскол", "Степное", "Стерлитамак", "Стрежевой", "Строитель (Белгородская область)", "Строитель (Тамбовская область)", "Струнино", "Ступино", "Суворов", "Суворовская", "Судак", "Сузун", "Сургут", "Суровикино", "Сурхахи", "Сухиничи", "Суходол", "Сухой Лог", "Сходня", "Сызрань", "Сыктывкар", "Сысерть", "Тавда", "Таганрог", "Тайга", "Тайшет", "Талица", "Талнах", "Тальменка", "Тамбов", "Тара", "Тарко-Сале", "Татарск", "Таштагол", "Тбилисская", "Тверь", "Тейково", "Темрюк", "Терек", "Тимашевск", "Тихвин", "Тихорецк", "Тобольск", "Товарково", "Тогучин", "Тольятти", "Томилино", "Томск", "Топки", "Торжок", "Торопец", "Тосно", "Тоцкое Второе", "Трехгорный", "Троицк (Московская область)", "Троицк (Челябинская область)", "Троицкая", "Трубчевск", "Трудовое", "Туапсе", "Туймазы", "Тула", "Тулун", "Туринск", "Тутаев", "Тучково", "Тында", "Тырныауз", "Тюмень", "Тяжинский", "Ува", "Уварово", "Углич", "Удачный", "Удомля", "Ужур", "Узловая", "Улан-Удэ", "Ульяновск", "Унеча", "Урай", "Урус-Мартан", "Урюпинск", "Усинск", "Усмань", "Усолье-Сибирское", "Уссурийск", "Усть-Абакан", "Усть-Джегута", "Усть-Илимск", "Усть-Катав", "Усть-Кут", "Усть-Лабинск", "Усть-Ордынский", "Уфа", "Ухта", "Учалы", "Учкекен", "Федоровский", "Феодосия", "Фокино (Брянская область)", "Фокино (Приморский край)", "Фролово", "Фрязино", "Фурманов", "Хабаровск", "Хадыженск", "Ханты-Мансийск", "Харабали", "Хасавюрт", "Химки", "Холмск", "Холмская", "Хотьково", "Цимлянск", "Цоцин-Юрт", "Чайковский", "Чалтырь", "Чапаевск", "Чебаркуль", "Чебоксары", "Чегдомын", "Чегем", "Челябинск", "Черемхово", "Черепаново", "Череповец", "Черкесск", "Черниговка", "Черноголовка", "Черногорск", "Чернушка", "Чернянка", "Черняховск", "Чехов", "Чистополь", "Чита", "Чишмы", "Чудово", "Чунский", "Чусовой", "Шадринск", "Шали", "Шарыпово", "Шарья", "Шатура", "Шахты", "Шахунья", "Шебекино", "Шексна", "Шелехов", "Шерловая Гора", "Шилка", "Шилово", "Шимановск", "Шумерля", "Шумиха", "Шушары", "Шушенское", "Шуя", "Щекино", "Щелково", "Щербинка", "Щигры", "Экажево", "Электрогорск", "Электросталь", "Электроугли", "Элиста", "Энгельс", "Энем", "Юбилейный", "Югорск", "Южа", "Южно-Сахалинск", "Южноуральск", "Южный", "Юрга", "Юрьев-Польский", "Юрюзань", "Яблоновский", "Якутск", "Ялта", "Ялуторовск", "Янаул", "Яранск", "Яровое", "Ярославль", "Ярцево", "Ясногорск", "Ясный", "Яшкино", "Алтайский край", "Амурская область", "Архангельская область", "Астраханская область", "Белгородская область", "Брянская область", "Владимирская область", "Волгоградская область", "Вологодская область", "Воронежская область", "Еврейская АО", "Забайкальский край", "Ивановская область", "Иркутская область", "Кабардино-Балкарская Республика", "Калининградская область", "Калужская область", "Камчатский край", "Карачаево-Черкесская Республика", "Кемеровская область", "Кировская область", "Костромская область", "Краснодарский край", "Красноярский край", "Курганская область", "Курская область", "Ленинградская область", "Липецкая область", "Магаданская область", "Московская область", "Мурманская область", "Ненецкий АО", "Нижегородская область", "Новгородская область", "Новосибирская область", "Омская область", "Оренбургская область", "Орловская область", "Пензенская область", "Пермский край", "Приморский край", "Псковская область", "Республика Адыгея", "Республика Алтай", "Республика Башкортостан", "Республика Бурятия", "Республика Дагестан", "Республика Ингушетия", "Республика Калмыкия", "Республика Карелия", "Республика Коми", "Республика Крым", "Республика Марий Эл", "Республика Мордовия", "Республика Саха (Якутия)", "Республика Северная Осетия - Алания", "Республика Татарстан", "Республика Тыва", "Республика Хакасия", "Ростовская область", "Рязанская область", "Самарская область", "Саратовская область", "Сахалинская область", "Свердловская область", "Смоленская область", "Ставропольский край", "Тамбовская область", "Тверская область", "Томская область", "Тульская область", "Тюменская область", "Удмуртская Республика", "Ульяновская область", "Хабаровский край", "Ханты-Мансийский АО", "Челябинская область", "Чеченская Республика", "Чувашская Республика", "Чукотский АО", "Ямало-Ненецкий АО", "Ярославская область");
        var k = new Array(19, 19, 56, 23, 20, 2, 16, 16, 61, 14, 56, 61, 15, 66, 21, 14, 22, 33, 59, 26, 31, 71, 91, 16, 27, 87, 23, 38, 42, 36, 51, 50, 23, 66, 20, 15, 52, 26, 64, 23, 91, 25, 16, 25, 66, 29, 66, 70, 30, 64, 23, 30, 23, 24, 20, 74, 16, 61, 38, 90, 2, 74, 7, 40, 64, 52, 50, 64, 18, 75, 39, 54, 22, 73, 61, 91, 42, 20, 69, 63, 23, 61, 31, 2, 71, 42, 28, 22, 50, 2, 23, 86, 86, 54, 59, 24, 42, 66, 15, 22, 27, 79, 2, 28, 2, 26, 36, 66, 71, 52, 24, 38, 47, 69, 54, 25, 52, 75, 31, 36, 53, 72, 24, 38, 50, 23, 32, 16, 56, 26, 56, 16, 44, 5, 36, 53, 31, 27, 23, 16, 60, 53, 35, 29, 71, 59, 67, 74, 66, 66, 50, 41, 38, 37, 25, 15, 33, 50, 34, 61, 44, 12, 34, 35, 50, 47, 64, 11, 11, 36, 50, 50, 18, 25, 47, 11, 47, 52, 23, 69, 27, 33, 67, 43, 76, 67, 56, 44, 47, 39, 23, 26, 1, 18, 50, 4, 22, 74, 52, 34, 33, 34, 26, 23, 42, 36, 20, 48, 35, 59, 31, 89, 20, 61, 23, 42, 39, 3, 33, 2, 5, 45, 25, 25, 76, 48, 66, 50, 5, 67, 16, 91, 52, 50, 24, 26, 73, 23, 50, 59, 50, 50, 61, 26, 71, 50, 34, 7, 24, 2, 32, 91, 61, 50, 23, 66, 16, 34, 48, 23, 41, 74, 11, 24, 64, 26, 26, 71, 26, 24, 46, 38, 50, 68, 63, 34, 32, 50, 28, 72, 25, 15, 52, 16, 51, 50, 58, 66, 22, 61, 24, 50, 16, 26, 9, 61, 28, 38, 61, 74, 30, 37, 50, 66, 18, 18, 5, 86, 26, 24, 23, 73, 26, 11, 26, 66, 38, 55, 54, 50, 72, 2, 12, 25, 16, 24, 36, 34, 55, 39, 50, 23, 64, 42, 40, 69, 58, 66, 61, 22, 33, 16, 30, 34, 66, 21, 51, 23, 24, 6, 33, 74, 6, 54, 9, 32, 66, 74, 62, 74, 5, 74, 45, 66, 69, 50, 42, 42, 10, 91, 59, 5, 5, 71, 69, 47, 63, 63, 37, 71, 33, 47, 40, 43, 66, 43, 47, 51, 68, 42, 26, 32, 50, 50, 32, 51, 33, 13, 86, 24, 40, 12, 50, 70, 47, 66, 33, 47, 27, 13, 69, 10, 40, 61, 74, 62, 23, 74, 50, 65, 29, 71, 10, 44, 50, 34, 43, 29, 34, 68, 37, 54, 26, 50, 64, 59, 26, 50, 23, 47, 50, 75, 59, 54, 91, 34, 66, 66, 66, 24, 64, 61, 23, 23, 23, 50, 52, 50, 56, 59, 58, 54, 16, 52, 61, 22, 2, 59, 54, 24, 45, 23, 50, 46, 45, 20, 46, 74, 66, 23, 17, 74, 3, 23, 89, 8, 23, 33, 86, 48, 23, 16, 34, 42, 14, 26, 66, 25, 24, 57, 50, 54, 48, 36, 50, 47, 50, 50, 47, 50, 25, 52, 59, 50, 46, 50, 40, 86, 49, 6, 74, 1, 4, 7, 50, 53, 6, 40, 44, 42, 64, 61, 5, 86, 12, 23, 10, 56, 2, 42, 33, 2, 16, 16, 47, 74, 61, 26, 24, 29, 14, 34, 26, 68, 50, 18, 15, 50, 51, 61, 68, 50, 50, 23, 89, 51, 51, 33, 57, 42, 50, 16, 52, 32, 89, 24, 6, 7, 50, 7, 83, 50, 25, 60, 65, 26, 66, 26, 69, 44, 75, 14, 6, 63, 2, 26, 86, 86, 16, 38, 58, 52, 66, 66, 66, 51, 34, 27, 58, 50, 47, 66, 36, 26, 22, 34, 36, 29, 32, 23, 42, 63, 62, 71, 26, 23, 23, 54, 22, 74, 23, 56, 64, 73, 66, 21, 61, 61, 42, 31, 89, 50, 24, 89, 16, 59, 86, 29, 40, 46, 54, 50, 74, 50, 63, 2, 53, 51, 55, 43, 29, 6, 57, 56, 50, 61, 56, 59, 42, 69, 60, 36, 23, 47, 63, 65, 59, 52, 22, 36, 47, 23, 50, 34, 25, 23, 58, 52, 66, 50, 76, 59, 61, 53, 47, 34, 64, 75, 10, 41, 33, 11, 47, 71, 74, 36, 50, 47, 86, 86, 33, 66, 23, 42, 51, 51, 65, 63, 32, 37, 64, 36, 23, 47, 2, 42, 61, 42, 50, 7, 60, 64, 47, 50, 50, 86, 26, 33, 86, 2, 31, 28, 50, 68, 66, 66, 50, 66, 69, 37, 74, 67, 36, 76, 61, 50, 64, 22, 13, 76, 62, 46, 62, 62, 91, 2, 89, 61, 63, 47, 56, 13, 18, 64, 52, 62, 74, 67, 19, 38, 26, 39, 47, 38, 28, 26, 91, 71, 3, 29, 51, 66, 70, 23, 10, 3, 32, 52, 61, 36, 52, 50, 58, 66, 50, 47, 47, 2, 74, 91, 62, 22, 25, 23, 47, 43, 38, 67, 74, 33, 39, 43, 27, 86, 35, 59, 50, 27, 56, 56, 10, 24, 47, 11, 50, 23, 25, 66, 26, 50, 53, 32, 23, 23, 31, 64, 2, 70, 31, 68, 33, 50, 71, 26, 91, 54, 86, 34, 6, 40, 63, 66, 50, 63, 11, 66, 66, 61, 42, 38, 66, 24, 22, 68, 55, 89, 54, 42, 23, 69, 37, 23, 7, 23, 47, 23, 72, 40, 54, 63, 50, 70, 42, 69, 69, 47, 56, 74, 50, 74, 6, 32, 25, 23, 2, 71, 38, 66, 76, 50, 28, 7, 72, 42, 18, 68, 76, 14, 69, 24, 71, 3, 73, 32, 86, 20, 34, 11, 48, 38, 25, 19, 9, 38, 74, 38, 23, 38, 2, 11, 2, 9, 86, 91, 32, 25, 34, 50, 37, 27, 23, 86, 30, 5, 50, 65, 23, 50, 61, 20, 59, 61, 63, 74, 21, 27, 7, 74, 38, 54, 35, 9, 25, 50, 19, 59, 31, 39, 50, 16, 75, 2, 53, 38, 59, 45, 20, 24, 44, 50, 61, 52, 31, 35, 38, 75, 75, 62, 28, 21, 45, 47, 24, 37, 71, 50, 50, 46, 6, 50, 50, 50, 8, 64, 1, 50, 86, 37, 65, 74, 22, 42, 33, 74, 1, 14, 91, 72, 2, 43, 22, 76, 67, 71, 56, 42, 22, 28, 29, 30, 31, 32, 33, 34, 35, 36, 79, 75, 37, 38, 7, 39, 40, 41, 9, 42, 43, 44, 23, 24, 45, 46, 47, 48, 49, 50, 51, 83, 52, 53, 54, 55, 56, 57, 58, 59, 25, 60, 1, 4, 2, 3, 5, 6, 8, 10, 11, 91, 12, 13, 14, 15, 16, 17, 19, 61, 62, 63, 64, 65, 66, 67, 26, 68, 69, 70, 71, 72, 18, 73, 27, 86, 74, 20, 21, 87, 89, 76);
        var r = new Array("", "Республика Адыгея", "Республика Башкортостан", "Республика Бурятия", "Республика Алтай", "Республика Дагестан", "Республика Ингушетия", "Кабардино-Балкарская Республика", "Республика Калмыкия", "Карачаево-Черкесская Республика", "Республика Карелия", "Республика Коми", "Республика Марий Эл", "Республика Мордовия", "Республика Саха (Якутия)", "Республика Северная Осетия - Алания", "Республика Татарстан", "Республика Тыва", "Удмуртская Республика", "Республика Хакасия", "Чеченская Республика", "Чувашская Республика", "Алтайский край", "Краснодарский край", "Красноярский край", "Приморский край", "Ставропольский край", "Хабаровский край", "Амурская область", "Архангельская область", "Астраханская область", "Белгородская область", "Брянская область", "Владимирская область", "Волгоградская область", "Вологодская область", "Воронежская область", "Ивановская область", "Иркутская область", "Калининградская область", "Калужская область", "Камчатский край", "Кемеровская область", "Кировская область", "Костромская область", "Курганская область", "Курская область", "Ленинградская область", "Липецкая область", "Магаданская область", "Московская область", "Мурманская область", "Нижегородская область", "Новгородская область", "Новосибирская область", "Омская область", "Оренбургская область", "Орловская область", "Пензенская область", "Пермский край", "Псковская область", "Ростовская область", "Рязанская область", "Самарская область", "Саратовская область", "Сахалинская область", "Свердловская область", "Смоленская область", "Тамбовская область", "Тверская область", "Томская область", "Тульская область", "Тюменская область", "Ульяновская область", "Челябинская область", "Забайкальский край", "Ярославская область", "", "", "Еврейская АО", "", "", "", "Ненецкий АО", "", "", "Ханты-Мансийский АО", "Чукотский АО", "", "Ямало-Ненецкий АО", "Байконур", "Республика Крым");
        var ToCity1 = '';
        var Rus1 = 1;
        function cr1() {
        $("#Err1").html('');
                $("#rz").html('');
                var r = '';
                if ($("#edost_to_city").val() == '') r = r + 'Не заполнен город доставки!<br>';
                if ($("#edost_weight").val() == '') r = r + 'Не заполнен вес!<br>';
                else {
                var y = 0;
                        var k9 = $("#edost_weight").val();
                        if ((y = k9.indexOf(",")) >= 0) {k9 = k9.replace(",", "."); }
                if (isNaN(k9)) {r = r + 'Вес должен быть цифра!'; }
                }

        if (r != '') {
        $("#Err1").html(r);
                return false;
        }

        sToCity = $("#edost_to_city").val();
                sWeight = $("#edost_weight").val();
                strah = $("#edost_strah").val();
                edost_lenght = $("#edost_lenght").val();
                edost_width = $("#edost_width").val();
                edost_height = $("#edost_height").val();
                edost_zip = $("#edost_zip").val();
                sWaitLoad = '<b>Идет расчет стоимости доставки. Ждите...<\/b>';
                $("#rz").html(sWaitLoad);
                $("#rz").load('phpshop/templates/prodacha/javascript/edost_example/edost.php', {edost_to_city:sToCity, edost_weight:sWeight, edost_strah:strah, edost_kod:"1", edost_rus:Rus1, edost_lenght:edost_lenght, edost_width:edost_width, edost_height:edost_height, edost_zip:edost_zip}, function(){});
                }


function explode(delimiter, string) {	// Split a string by string
// 
// +   original by: Kevin van Zonneveld (http://kevin.vanzonneveld.net)
// +   improved by: kenneth
// +   improved by: Kevin van Zonneveld (http://kevin.vanzonneveld.net)

var emptyArray = { 0: '' };
        if (arguments.length != 2
                || typeof arguments[0] == 'undefined'
                || typeof arguments[1] == 'undefined')
{
return null;
}

if (delimiter === ''
        || delimiter === false
        || delimiter === null)
{
return false;
}

if (typeof delimiter == 'function'
        || typeof delimiter == 'object'
        || typeof string == 'function'
        || typeof string == 'object')
{
return emptyArray;
}

if (delimiter === true) {
delimiter = '1';
}

return string.toString().split (delimiter.toString());
        }

function in_array(needle, haystack, strict) {
// Checks if a value exists in an array
// in_array('van', ['Kevin', 'van', 'Zonneveld']);
// 
// +   original by: Kevin van Zonneveld (http://kevin.vanzonneveld.net)

var found = false, key, strict = !!strict;
        for (key in haystack) {
if ((strict && haystack[key] === needle) || (!strict && haystack[key] == needle)) {
found = true;
        break;
}
}

return found;
        }

//Скрываем товары по фильтру производителя
function showManufProduct(obj)
        {
        // console.log('showManufProduct(' + obj + ')');
        var classNames = explode(';', $(obj).attr('classToAdd'));
                for (var i in classNames)
        {
        if (classNames[i])
        {
        if ($(obj).attr('checked') != 'checked')
        {
        $('div.' + classNames[i]).addClass('dn');
        }
        else
        {
        $('div.' + classNames[i]).removeClass('dn');
        }
        }
        }
        }

function showM()
        {
        $.ajax({
        url: '/custom_config/filter.php?category=' + $('input[name=\'category_\']').val(),
                type: 'post',
                dataType: 'json',
                data: $('#filter_ input[type=\'checkbox\']:visible:checked'),
                beforeSend: function() {
                $('div#_tool_').addClass('dn');
                },
                complete: function() {

                },
                success: function(json) {
                if (json['mas']){
                for (var i = 0; json['mas'].length; i++){
                //alert(json['mas'][i].id);
                $('div.' + json['mas'][i].id).removeClass('dn');
                }
                }
                /*for (var i in classNames)
                 {
                 if (classNames[i])
                 {
                 if ($(obj).attr('checked') != 'checked')
                 {
                 $('div.' + classNames[i]).addClass('dn');
                 }
                 else
                 {
                 $('div.' + classNames[i]).removeClass('dn');
                 }
                 }
                 }*/
                }
        });
                /*var mas_ = [];
                 for (i=0;i<$('#filter_ input.checkbox').length;i++)
                 {	
                 if($('#filter_ input.checkbox').attr('checked') == 'checked'){
                 var classNames = explode(';', $('#filter_ input.checkbox').attr('classToAdd'));
                 for (var i in classNames)
                 {
                 mas_.push(classNames[i]);
                 }
                 }*/
                //
                //alert();
                //var classNames = explode(';', $('#filter_ input.checkbox').attr('classToAdd'));
                //alert(classNames);
                //for (var i in classNames)
                //{
                //mas_.push(i);
                //alert(i);
                //}
                //}
//	}
                //alert(mas_);
                /*var classNames = explode(';', $(obj).attr('classToAdd'));
                 
                 for (var i in classNames)
                 {
                 if (classNames[i])
                 {
                 if ($(obj).attr('checked') != 'checked')
                 {
                 $('div.' + classNames[i]).addClass('dn');
                 }
                 else
                 {
                 $('div.' + classNames[i]).removeClass('dn');
                 }
                 }
                 }*/
                }

var myTimer;
/* Plugin */
$(document).ready(function() {

//скрытие <p> при пустых <ul>
$('p.menublock').each(function(){
if ($(this).next().find('li').length == 0) $(this).hide();
});
        //в кредит	
        $("input.creditinput").click(function(e){

var id = $(this).attr('rel');
        var url = 'http://prodacha.ru/crediter.php?id=' + id;
        var isAdded = AddToCart(id);
        if (isAdded === true)
{
$.fancybox
        ({
        width : 300,
                height : 130,
                overlayOpacity:0,
                autoSize:false,
                type: 'iframe',
                href: url
        });
        // $('div.bic_box').show();
}
});
        //в кредит из карточки
        $("input.creditinputcart").click(function(e){

var id = $(this).attr('rel');
        var url = 'http://prodacha.ru/crediter.php?id=' + id;
        var cnt = $(this).attr('cnt');
        var isAdded = AddToCartNum(id, cnt);
        if (isAdded === true)
{
ga('send', 'event', 'buy-in-credit', 'click');
        //console.log('buy-in-credit');
        $.fancybox
        ({
        width : 300,
                height : 130,
                overlayOpacity:0,
                autoSize:false,
                type: 'iframe',
                href: url
        });
}
});
        // Отметить все
        // собираем информацию о существующих классах товаров
        var manufacturers_products = [];
        $('#manufacturers_products div[class^="tool_"]').each(function(){
manufacturers_products.push($(this).attr('class'));
});
        //console.log(manufacturers_products);
        // Оставляем Производителей (инпуты) с товарами
        $('#filter_ input[type="checkbox"]').each(function(){
var classNames = explode(';', $(this).attr('classToAdd'));
        var classExists = false;
        //console.log(classNames);
        for (var i in classNames)
{
if (classNames[i] && in_array(classNames[i], manufacturers_products))
{
classExists = true;
        break;
}
}

if (!classExists)
{
//$(this).parent().parent().remove();
}
});
        //alert($('#filter_ .colorcheck').length);
        j = 0;
        for (i = 0; i < $('#filter_ .colorcheck').length; i++){

if ($('#id_' + i + ' label').length == 1){
//$('.block_'+i).hide();
j++;
}
}
if (j == $('#filter_ .colorcheck').length){
//$('#filter_').hide();
}

$('input.checkbox').click(function(){
//showManufProduct($(this));
//showM();
});
        // Скрываем неактивные табы (Файлы, Рейтинг и т.д.)
        $('ul.tabNavigation a').each(function() {
var tab = $($(this).attr('href'));
        var isEmpty = false;
        var title = $(this).text();
        //Убираем вкладку tab3 звездочки должны быть перенесены в блок характеристик под фотографию 
        if ($(tab).selector == '#tab3') {
//console.log($(tab).selector);
$(this).closest('li').remove();
}

if ($(tab).is(':empty'))
{
isEmpty = true;
}
else
{
var tabContent = $(tab).text();
        if (tabContent == 'Нет файлов')
{
isEmpty = true;
}
}

if (isEmpty)
{
$(this).closest('li').addClass('empty');
        $(this).hide().after('<span>' + title + '</span>');
}
});
        $("#slides").slides({
preload:true,
        preloadImage:"images/loader.gif",
        play:3000,
        pause:2500,
        hoverPause:true,
        paginationClass: 'slider_pagination'
});
        $('.left .menu .mainmenu > li').click(function (event) {
var target = $(event.target);
        //$("#fade").css("display", "block");
        //alert(target.is("li"));

        $('.mainmenu').find(".submenuhead").fadeOut('fast');
        if ($(this).attr("id-info") == 288){
//"мотоблоки"
if ($($(this).next('li')).attr("id-info") == 37) {
if ($(this).next('li').css("display") == "block") {
$(this).next('li').css("display", "none");
} else if ($(this).next('li').css("display") == "none") {
$(this).next('li').css("display", "block");
}
//console.log('37 clicked');
}
//культиваторы
if ($($(this).nextAll('li').get(1)).attr("id-info") == 44) {
if ($($(this).nextAll('li').get(1)).css("display") == "block") {
$($(this).nextAll('li').get(1)).css("display", "none");
} else if ($($(this).nextAll('li').get(1)).css("display") == "none") {
$($(this).nextAll('li').get(1)).css("display", "block");
}
//console.log('44 clicked');
}
//навесное оборудование для мотоблоков
if ($($(this).nextAll('li').get(2)).attr("id-info") == 16) {
if ($($(this).nextAll('li').get(2)).css("display") == "block") {
$($(this).nextAll('li').get(2)).css("display", "none");
} else if ($($(this).nextAll('li').get(2)).css("display") == "none") {
$($(this).nextAll('li').get(2)).css("display", "block");
}
//console.log('16 clicked');
}
//двигатели для мотоблоков
if ($($(this).nextAll('li').get(3)).attr("id-info") == 5) {
if ($($(this).nextAll('li').get(3)).css("display") == "block") {
$($(this).nextAll('li').get(3)).css("display", "none");
} else if ($($(this).nextAll('li').get(3)).css("display") == "none") {
$($(this).nextAll('li').get(3)).css("display", "block");
}
//console.log('5 clicked');
}
//запчасти, расходники для мотоблоков
if ($($(this).nextAll('li').get(4)).attr("id-info") == 36) {
if ($($(this).nextAll('li').get(4)).css("display") == "block") {
$($(this).nextAll('li').get(4)).css("display", "none");
} else if ($($(this).nextAll('li').get(4)).css("display") == "none") {
$($(this).nextAll('li').get(4)).css("display", "block");
}
//console.log('36 clicked');
}
var spanelements = $('.mainmenu').find("li");
        spanelements.each(function(index) {

        if ($(this).attr("id-info") == 37) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 44) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 16) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 5) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 36) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }

        });
}


//console.log($($($(this).children("span")[0]).children("div")[0]).text().toLowerCase().substring(0,22));
if ($(this).attr("id-info") == 60) { //'снегоуборщики'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        //$('.mainmenu').find(".submenuhead").fadeOut('fast');
        //$(this).children(".submenuhead").fadeIn('fast');
        //console.log(target);
        if (target.is("div")) {
//console.log(target.parent().next(".submenuhead"));
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
}
if ($(this).attr("id-info") == 9) {//'генераторы'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        //$('.mainmenu').find(".submenuhead").fadeOut('fast');
        //$(this).children(".submenuhead").fadeIn('fast');
        //console.log(target);
        if (target.is("div")) {
//console.log(target.parent().next(".submenuhead"));
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
//console.log(target.parents("span").next(".submenuhead"));
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}
//'техника для газона'
if ($(this).attr("id-info") == 290){
//"Газонокосилки"
if ($($(this).nextAll('li').get(5)).attr("id-info") == 18) {
if ($($(this).nextAll('li').get(5)).css("display") == "block") {
$($(this).nextAll('li').get(5)).css("display", "none");
} else if ($($(this).nextAll('li').get(5)).css("display") == "none") {
$($(this).nextAll('li').get(5)).css("display", "block");
}
//console.log('18 clicked');
}
//Триммеры для травы
if ($($(this).nextAll('li').get(6)).attr("id-info") == 85) {
if ($($(this).nextAll('li').get(6)).css("display") == "block") {
$($(this).nextAll('li').get(6)).css("display", "none");
} else if ($($(this).nextAll('li').get(6)).css("display") == "none") {
$($(this).nextAll('li').get(6)).css("display", "block");
}
//console.log('85 clicked');
}
//Аэраторы, вертикуттеры, скарификаторы
if ($($(this).nextAll('li').get(7)).attr("id-info") == 215) {
if ($($(this).nextAll('li').get(7)).css("display") == "block") {
$($(this).nextAll('li').get(7)).css("display", "none");
} else if ($($(this).nextAll('li').get(7)).css("display") == "none") {
$($(this).nextAll('li').get(7)).css("display", "block");
}
//console.log('215 clicked');
}
//Сенокосилки фронтальные
if ($($(this).nextAll('li').get(8)).attr("id-info") == 299) {
if ($($(this).nextAll('li').get(8)).css("display") == "block") {
$($(this).nextAll('li').get(8)).css("display", "none");
} else if ($($(this).nextAll('li').get(8)).css("display") == "none") {
$($(this).nextAll('li').get(8)).css("display", "block");
}
//console.log('299 clicked');
}
//Садовые ножницы и кусторезы
if ($($(this).nextAll('li').get(9)).attr("id-info") == 297) {
if ($($(this).nextAll('li').get(9)).css("display") == "block") {
$($(this).nextAll('li').get(9)).css("display", "none");
} else if ($($(this).nextAll('li').get(9)).css("display") == "none") {
$($(this).nextAll('li').get(9)).css("display", "block");
}
//console.log('297 clicked');
}
//Подрезчики края газона
if ($($(this).nextAll('li').get(10)).attr("id-info") == 254) {
if ($($(this).nextAll('li').get(10)).css("display") == "block") {
$($(this).nextAll('li').get(10)).css("display", "none");
} else if ($($(this).nextAll('li').get(10)).css("display") == "none") {
$($(this).nextAll('li').get(10)).css("display", "block");
}
//console.log('254 clicked');
}
//Садовые катки и валики
if ($($(this).nextAll('li').get(11)).attr("id-info") == 272) {
if ($($(this).nextAll('li').get(11)).css("display") == "block") {
$($(this).nextAll('li').get(11)).css("display", "none");
} else if ($($(this).nextAll('li').get(11)).css("display") == "none") {
$($(this).nextAll('li').get(11)).css("display", "block");
}
//console.log('272 clicked');
}

var spanelements = $('.mainmenu').find("li");
        spanelements.each(function(index) {

        if ($(this).attr("id-info") == 18) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 85) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 215) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 299) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 297) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 254) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 272) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }

        });
}

if ($(this).attr("id-info") == 77) {//'цепные пилы'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}

//'Благоустройство участка'
if ($(this).attr("id-info") == 292){
//console.log($($(this).nextAll('li').get(12)).attr("id-info"));
//"Мотобуры"
if ($($(this).nextAll('li').get(12)).attr("id-info") == 142) {
if ($($(this).nextAll('li').get(12)).css("display") == "block") {
$($(this).nextAll('li').get(12)).css("display", "none");
} else if ($($(this).nextAll('li').get(12)).css("display") == "none") {
$($(this).nextAll('li').get(12)).css("display", "block");
}
//console.log('142 clicked');
}
//Мотопомпы для воды
if ($($(this).nextAll('li').get(13)).attr("id-info") == 293) {
if ($($(this).nextAll('li').get(13)).css("display") == "block") {
$($(this).nextAll('li').get(13)).css("display", "none");
} else if ($($(this).nextAll('li').get(13)).css("display") == "none") {
$($(this).nextAll('li').get(13)).css("display", "block");
}
//console.log('293 clicked');
}
//console.log($($(this).nextAll('li').get(14)).attr("id-info"));
//Водяные насосы
if ($($(this).nextAll('li').get(14)).attr("id-info") == 503) {
if ($($(this).nextAll('li').get(14)).css("display") == "block") {
$($(this).nextAll('li').get(14)).css("display", "none");
} else if ($($(this).nextAll('li').get(14)).css("display") == "none") {
$($(this).nextAll('li').get(14)).css("display", "block");
}
//console.log('503 clicked');
}
//Садовые воздуходувы
if ($($(this).nextAll('li').get(15)).attr("id-info") == 88) {
if ($($(this).nextAll('li').get(15)).css("display") == "block") {
$($(this).nextAll('li').get(15)).css("display", "none");
} else if ($($(this).nextAll('li').get(15)).css("display") == "none") {
$($(this).nextAll('li').get(15)).css("display", "block");
}
//console.log('88 clicked');
}
//Дровоколы
if ($($(this).nextAll('li').get(16)).attr("id-info") == 224) {
if ($($(this).nextAll('li').get(16)).css("display") == "block") {
$($(this).nextAll('li').get(16)).css("display", "none");
} else if ($($(this).nextAll('li').get(16)).css("display") == "none") {
$($(this).nextAll('li').get(16)).css("display", "block");
}
//console.log('224 clicked');
}
//Садовые измельчители
if ($($(this).nextAll('li').get(17)).attr("id-info") == 256) {
if ($($(this).nextAll('li').get(17)).css("display") == "block") {
$($(this).nextAll('li').get(17)).css("display", "none");
} else if ($($(this).nextAll('li').get(17)).css("display") == "none") {
$($(this).nextAll('li').get(17)).css("display", "block");
}
//console.log('256 clicked');
}
//Высоторезы
if ($($(this).nextAll('li').get(18)).attr("id-info") == 298) {
if ($($(this).nextAll('li').get(18)).css("display") == "block") {
$($(this).nextAll('li').get(18)).css("display", "none");
} else if ($($(this).nextAll('li').get(18)).css("display") == "none") {
$($(this).nextAll('li').get(18)).css("display", "block");
}
//console.log('298 clicked');
}
//Виброплиты
if ($($(this).nextAll('li').get(19)).attr("id-info") == 172) {
if ($($(this).nextAll('li').get(19)).css("display") == "block") {
$($(this).nextAll('li').get(19)).css("display", "none");
} else if ($($(this).nextAll('li').get(19)).css("display") == "none") {
$($(this).nextAll('li').get(19)).css("display", "block");
}
//console.log('172 clicked');
}
//Садовые инструменты
if ($($(this).nextAll('li').get(20)).attr("id-info") == 536) {
if ($($(this).nextAll('li').get(20)).css("display") == "block") {
$($(this).nextAll('li').get(20)).css("display", "none");
} else if ($($(this).nextAll('li').get(20)).css("display") == "none") {
$($(this).nextAll('li').get(20)).css("display", "block");
}
//console.log('536 clicked');
}

var spanelements = $('.mainmenu').find("li");
        spanelements.each(function(index) {

        if ($(this).attr("id-info") == 142) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 293) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 503) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 88) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 224) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 256) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 298) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 172) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }
        if ($(this).attr("id-info") == 536) {

        $(this).click(function(event) {
        var target = $(event.target);
                document.getElementById('fade').style.display = 'block';
                if (target.is("span")) {
        target.next(".submenuhead").fadeIn('fast');
        }
        if (target.is("li")) {
        target.children(".submenuhead").fadeIn('fast');
        }
        });
        }

        });
}

if ($(this).attr("id-info") == 211) {//'тракторы и райдеры'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}
if ($(this).attr("id-info") == 134) {//'техника karcher'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}
if ($(this).attr("id-info") == 228) {//'техника stihl'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
//console.log(target.parents("span").next(".submenuhead"));
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}
//console.log($(this).children("div")[0].text());
if ($(this).attr("id-info") == 295) {//'техника viking'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}
if ($(this).attr("id-info") == 300) {//'акции, скидки'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
//console.log(target.parent().next(".submenuhead"));
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
//console.log(target.parents("span").next(".submenuhead"));
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}

if ($(this).attr("id-info") == 472) {//'техника по производителю'
//console.log($($(this).children("span")[0]).children("div").text());
document.getElementById('fade').style.display = 'block';
        if (target.is("div")) {
//console.log(target.parent().next(".submenuhead"));
target.parent().next(".submenuhead").fadeIn('fast');
}
if (target.is("li")) {
target.children(".submenuhead").fadeIn('fast');
}
if (target.is("img")) {
//console.log(target.parents("span").next(".submenuhead"));
target.parents("span").next(".submenuhead").fadeIn('fast');
}
}

});
$('.menu').mouseleave(function() {
        $(document).find(".submenuhead").fadeOut('fast');
        $("#fade").css("display", "none");
});
$('.login_popup').click(function() {
        $('.log_popup').fadeIn('fast');
});
$('.city_link').click(function() {
        $('.city_popup').fadeIn('fast');
});
$('.log_popup, .city_popup').mouseleave(function() {
        $(this).fadeOut('fast');
});
        /* Sorted items paginate */
        $('#paging_container').pajinate({
        num_page_links_to_display : 4,
        items_per_page : 3,
        nav_label_prev : '<',
        nav_label_next : '>'
});
        //добавляем контент со звездами рейтинга в div IMGloader
        $('#IMGloader').append('<div id="tab3_m"></div>');
        $('#tab3_m').append($('#tab3').html());
        //Убираем содержимое tab3 звездочки должны быть перенесены в блок характеристик под фотографию
        $('#tab3').remove();
        //productPrice=$('.addchart_block_table_price div').text();
        //productPrice=productPrice.substring(0, (productPrice.search('руб')-1));
        //$('.addchart_block_table_price').empty();
        //$('.addchart_block_table_price').last().attr('id','addchart_block_table_price_1');
        //$('#addchart_block_table_price_1').append('<span id="price_margino_1" class="price margino"></span>');
        //$('#price_margino_1').append('<span id="sub_price_margino_1" class="sub_price_margino"></span>');//add('span').addclass('sub_price_margino'); //" style="font-size: 22px; text-transform: uppercase;">Цена</span>');
        //$('#sub_price_margino_1').css('font-size','22px');
        //$('#sub_price_margino_1').css('text-transform','uppercase');
        //$('#sub_price_margino_1').text('Цена');
        //$('#price_margino_1').append('<div id="Price">'+productPrice+'<span class="smallfont"> руб.</span></div>');
        //$('#addchart_block_table_price_1').append('<span id="prev_price_1" class="prev_price"></span>');
        //console.log('productPrice='+productPrice);
        //console.log('addchart_block_table_price='+$('.addchart_block_table_price').html());

        //var credit_forma_el=document.getElementById('credit_forma');
        //if (typeof(credit_forma_el) != 'undefined' && credit_forma_el != null) {
        //	credit_forma_el.onclick;
        //}
        if ($('#credit_forma').length) {
            $('#credit_forma').click();
}
if ($('#select_vendor_brand').length && $('#select_vendor_city').length) {
    $('#select_vendor_brand').change();
    $('#select_vendor_city').change();
}

myTimer = setTimeout("showNext()", 3000);
showNext(); //loads first image
if ($('#thumbs li').length) {
    $('#thumbs li').bind('click', function(e){
    var count = $(this).attr('rel');
    showImage(parseInt(count) - 1);
});
}

//работаем с tab'ami
if ($('div.tabs > div').length) {
    var tabContainers = $('div.tabs > div');
    tabContainers.hide().filter(':first').show();
    $('div.tabs ul.tabNavigation a').click(function () {
    tabContainers.hide();
    tabContainers.filter(this.hash).show();
    $('div.tabs ul.tabNavigation a').removeClass('selected');
    $(this).addClass('selected');
    return false;
}).filter(':visible:first').click();
}
if ($("#mail").length ||
        $("#name_person").length ||
        $("#tel_name").length ||
        $("#edost_to_city").length ||
        $("input[name='org_name']").length ||
        $("input[name='org_inn']").length ||
        $("input[name='org_kpp']").length ||
        $("input[name='annual_number']").length ||
        $("input[name='bic_bank_number']").length ||
        $("input[name='bank_name']").length ||
        $("input[name='gen_manager_initial']").length ||
        $("input[name='dos_ot']").length ||
        $("input[name='dos_do']").length) {
//всплывающие подсказки в доставке при заполнении полей
//$( "#mail" ).popover({placement : 'right'});//({ position: { my: "left+23 center", at: "right center",of: "#mail"} });
//$( "#name_person" ).popover({placement : 'right'});//.tooltip({ position: { my: "left+23 center", at: "right center",of: "#name_person"} });
//$( "#tel_name" ).popover({placement : 'right'});//.tooltip({ position: { my: "left+23 center", at: "right center",of: "#tel_name"} });
//$( "#edost_to_city" ).popover({placement : 'right'});//.tooltip({ position: { my: "left+23 center", at: "right center",of: "#edost_to_city"} });

$("#mail").mouseout(function() {
$(this).popover('hide');
        var regExpr = new RegExp('^[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?', 'ig');
        //console.log($(this).val());
        //console.log(regExpr.test($(this).val()));
        if (regExpr.test($(this).val()) === true && $(this).val() !== '') {
            $(this).css('border-color', '#abadb3');
        } else if (regExpr.test($(this).val()) === false && $(this).val() !== '') {
            $(this).css('border-color', '#ff5555');
        }
});
$("#mail").mouseover(function() {
        $(this).popover({placement : 'right'});
        $(this).css('border-color', '#abadb3');
});
$("#name_person").mouseout(function() {
        $(this).popover('hide');
        var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5* -_]{3,40}$', 'ig');
        //console.log($(this).val());
        //console.log(regExpr.test($(this).val()));
        if (regExpr.test($(this).val()) === true && $(this).val() !== '') {
            $(this).css('border-color', '#abadb3');
        } else if (regExpr.test($(this).val()) === false && $(this).val() !== '') {
            $(this).css('border-color', '#ff5555');
        }
});
        $("#name_person").mouseover(function() {
        $(this).popover({placement : 'right'});
        $(this).css('border-color', '#abadb3');
});
        //console.log($(this).inputmask("getmetadata")["name_en"]);
        //console.log($.browser);
        if (typeof ($.browser.android) === 'undefined')
        $("#tel_name").inputmask("mask", {mask: "+7(999)999-99-99"}); //{mask: "+7(9##)###-##-##"}
        else if (typeof ($.browser.android) !== 'undefined' && $.browser.android === true){
        $("#tel_name").attr("data-content", "Введите моб. телефон без восьмерки в формате: [9011234567]");
        $("#tel_name").attr("placeholder", "9011234567");
        $("#tel_name").attr("maxlength", "10");
}
$("#tel_name").mouseout(function() {
        $(this).popover('hide');
        if (typeof ($.browser.android) === 'undefined')
        var regExpr = new RegExp('^\+[7]\([0-9]{3}\)[0-9]{3}\-[0-9]{2}\-[0-9]{2}$', 'ig');
        else if (typeof ($.browser.android) !== 'undefined' && $.browser.android === true)
        var regExpr = new RegExp('^[0-9]{10}$', 'ig');
        //console.log($(this).val());
        //console.log(regExpr.test($(this).val()));
        if (regExpr.test($(this).val()) === true && $(this).val() !== '') {
            $(this).css('border-color', '#abadb3');
        } else if (regExpr.test($(this).val()) === false && $(this).val() !== '') {
            $(this).css('border-color', '#ff5555');
        }
});
$("#tel_name").mouseover(function() {
        $(this).popover({placement : 'right'});
        $(this).css('border-color', '#abadb3');
});
$("#tel_name").keyup(function(){
        $("#tel2").val($(this).val());
})
$("#edost_to_city").mouseout(function() {
        $(this).popover('hide');
});
$("#edost_to_city").mouseover(function() {
        $(this).popover({placement : 'right'});
});
$("input[name='dos_ot'],input[name='dos_do']").each(function() {
    $(this).inputmask("mask", {mask: "99"});
    $(this).mouseout(function() {
        //$(this).popover('hide');
        if (typeof ($.browser.android) === 'undefined')
            var regExpr = new RegExp('^(00|01|02|03|04|05|06|07|08|09|10|11|12|13|14|15|16|17|18|19|20|21|22|23)$', 'ig');
        if (typeof ($.browser.android) !== 'undefined' && $.browser.android === true)
            var regExpr = new RegExp('^(00|01|02|03|04|05|06|07|08|09|10|11|12|13|14|15|16|17|18|19|20|21|22|23)$', 'ig');
        //console.log($(this).val());
        //console.log(regExpr.test($(this).val()));
        //console.log(typeof($.browser.android));
        //console.log($.browser.android);
        if (regExpr.test($(this).val()) === true && $(this).val() !== '') {
            $(this).css('border-color', '#abadb3');
        } else if (regExpr.test($(this).val()) === false && $(this).val() !== '') {
            $(this).css('border-color', '#ff5555');
        }
    });
});
        $("input[name='org_name']").inputmask("mask", {mask: "*",
        "repeat": 100,
        "greedy": false,
        "showMaskOnFocus": true,
        definitions: {
        '*': {
        validator: ".",
                cardinality: 1
        }
        },
        onKeyValidation: function (result) {
        //console.log(result);
        }});
        $("input[name='org_inn']").inputmask("mask", {mask: "9", "repeat": 12, "greedy": true});
        $("input[name='org_kpp']").inputmask("mask", {mask: "9", "repeat": 9, "greedy": true});
        $("input[name='annual_number']").inputmask("mask", {mask: "9", "repeat": 20, "greedy": true});
        $("input[name='bic_bank_number']").inputmask("mask", {mask: "9", "repeat": 9, "greedy": true});
        $("input[name='bank_name']").inputmask("mask", {mask: "*",
        "repeat": 100,
        "greedy": false,
        "showMaskOnFocus": true,
        definitions: {
        '*': {
        validator: ".",
                cardinality: 1
        }
        },
        onKeyValidation: function (result) {
        //console.log(result);
        }});
        $("input[name='gen_manager_initial']").inputmask("mask", {mask: "*",
        "repeat": 100,
        "greedy": false,
        "showMaskOnFocus": true,
        definitions: {
        '*': {
        validator: ".",
                cardinality: 1
        }
        },
        onKeyValidation: function (result) {
        //console.log(result);
        }});
        var elements=new Array("#mail","#name_person","#tel_name");
        msie_text_color_correction(elements);
}
fillTKtablePart();
        /*
         if ($("input[type=submit]").length) {
         $("input[type=submit]").button().click(function( event ) {
         event.preventDefault();
         });	
         }
         */

                //функции работы с edost
                        function fillReg() {
                        var ToCity2 = $("#edost_to_city").val();
                                var weight2 = $("#edost_weight").val();
                                $("#Err1").html('');
                                if (ToCity1 != ToCity2) {
                        //---Находим код региона по выбранному городу---
                        var c1 = - 1;
                                var i;
                                for (i = 0; i < cit.length; i++){ if (cit[i] == ToCity2) {c1 = k[i]; break; } }
                        if (c1 == - 1) $("#ToReg").html('-');
                                else $("#ToReg").html(r[c1]);
                                $("#edost_weight").focus();
                        }
                        }

                function findValueCallback(event, data) {
                fillReg();
                }

                if ($("#edost_to_city").length){
                $("#edost_to_city").autocomplete({source:cit, change: function(event, ui) {fillReg(); }});
                }
                // Перевод раскладки в русскую
                function auto_layout_keyboard(str) {
                replacer = {
                "q": "й", "w": "ц", "e": "у", "r": "к", "t": "е", "y": "н", "u": "г",
                        "i": "ш", "o": "щ", "p": "з", "[": "х", "]": "ъ", "a": "ф", "s": "ы",
                        "d": "в", "f": "а", "g": "п", "h": "р", "j": "о", "k": "л", "l": "д",
                        ";": "ж", "'": "э", "z": "я", "x": "ч", "c": "с", "v": "м", "b": "и",
                        "n": "т", "m": "ь", ",": "б", ".": "ю", "/": "."
                };
                        return str.replace(/[A-z\,\.\;\'\]\[]/g, function(x) {
                        return x == x.toLowerCase() ? replacer[ x ] : replacer[ x.toLowerCase() ].toUpperCase();
                        });
                }

                // Стилизация select
                //$('select').styler();

                // Ajax поиск
                //форма поиска 
                $("#search").keyup(function() {
                var words = $(this).val();
                        if (words.length > 2) {
                $.ajax({
                type: "POST",
                        url: "/search/",
                        data: {
                        words: encodeURI(words),
                                set: 2,
                                ajax: true,
                                pole: 3
                }, error: function (request, error) {
                //console.log(arguments);
                //alert(" Ошибка ajax: " + error);
                }, success: function(data) {
                // Результат поиска
                if (data != 'false') {
                $("#search").attr('data-content', data);
                        $("#search").popover('show');
                } else
                        $("#search").popover('hide'); //popover('hide');
                        //('.form-control').css( "display", "table-cell", "important");
                }
                });
                } else $("#search").popover('hide');
                });
                        //форма поиска search
                        $("#search1").keyup(function() {
                var words = $(this).val();
                        if (words.length > 2) {
                $.ajax({
                type: "POST",
                        url: "/search/",
                        data: {
                        words: encodeURI(words),
                                set: 2,
                                ajax: true,
                                pole: 3
                }, error: function (request, error) {
                //console.log(arguments);
                //alert(" Ошибка ajax: " + error);
                }, success: function(data) {
                // Результат поиска
                if (data != 'false') {
                $("#search1").attr('data-content', data);
                        $("#search1").popover('show');
                } else
                        $("#search1").popover('hide'); //popover('hide');
                        //('.form-control').css( "display", "table-cell", "important");
                }
                });
                } else $("#search1").popover('hide');
                });
                if ($('#delivery_warning').length) {
                //console.log(typeof(document.getElementById('delivery_warning'))); 
                var req = new Subsys_JsHttpRequest_Js();
                        var xid = document.getElementById('seldelivery').value;
                        var sum = document.getElementById('OrderSumma').value;
                        var wsum = document.getElementById('WeightSumma').innerHTML;
                        req.onreadystatechange = function() {
                            if (req.readyState == 4) {
                                if (req.responseJS) {
                                    var z=(req.responseJS.total||'');	
                                    var city=(req.responseJS.city||'');

                                    if (Number(z)<5000 && Number(xid)!==69 && city!=='sp'){
                                       document.getElementById('delivery_warning').style.display="table-cell";
                                    } else if (Number(z)>=5000) {
                                      document.getElementById('delivery_warning').style.display="none";
                                    }
                                    //для питера модифицируем корзину удаляя все поля для цены < 1000
                                    if (((Number(xid)===69 || Number(xid)===0 || isNaN(Number(xid))) && city==='sp') && Number(z)<1000){
                                        $('#delivery_warning').html('Минимальная сумма заказа в интернет-магазине PROДАЧА в Санкт-Петербурге составляет 1000 руб. Пожалуйста, дополните ваш заказ до минимальной суммы.');
                                        $('#delivery_warning').css({'display':'table-cell','font-family':'tahoma', 'font-size':'12px'});
                                        $("form[name='forma_order']>table:eq(0) tr:eq(0)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(1)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(2)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(4)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(5)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(6)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(7)").css('display','none');
                                        $("form[name='forma_order']>table:eq(0) tr:eq(9)").css('display','none');
                                        $('#bin').css('display','none');
                                    }
                                    $('#dostavka_metod').change();
                                }
                            }
                        };
                req.caching = false;
                        // Подготваливаем объект.
                        // Реальное размещение
                        var dir = dirPath();
                        req.open('POST', dir + '/phpshop/ajax/delivery.php', true);
                        req.send({
                        xid: xid,
                                sum: sum,
                                wsum: wsum
                        });
                }
                //console.log($('.visible_all').length);
                if ($('.visible_all').length > 0){
                //console.log('3');
                $(".visible_all").each(function(index) {
                $(this).click();
                        //console.log($(this).text());
                });
                }
                //модификация CEO вывод сокрытие надписей в классе prev_price lostandfound
                //console.log($('.prev_price.lostandfound:first-child').length);
                /*
                if ($('.prev_price.lostandfound').length){
                   //$('.prev_price.lostandfound').next().html('уточните наличие');
                    $('.prev_price.lostandfound').each(function(index) {
                       $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');
                    });
                   //console.log('уточните наличие');
                }
           */

                if ($('.prev_price.lostandfound').length){
                    $('.prev_price.lostandfound').each(function(index) {
                        //исключение для блоков вывода по 3 купить,посмотреть аналог
                        //if ($(this).css('left')!='150px' && $(this).css('margin')!== '-15px 0px 0px 10px' && $(this).prev('div').prev('.price').prev('.addtochart').length)
                            //$(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');
                            //console.log($(this).prev('div').prev('.price').prev('.addtochart').length);
                        //для каталогов по 3 в ряд?    
                        if ($(this).parent('.price:eq(0)').prev('.addtochart:eq(0)').children('input[type="button"]:eq(0)').val()==='Как купить?')
                            $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');                                
                        //для каталогов по 1 в ряд?    
                        if ($(this).prev('.addtochart.notice:eq(0)').children('input[type="button"]:eq(0)').val()==='Как купить?')
                            $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');                                
                        //if ($(this).next('.price').next('.buybuttons:eq(0)').children('.addtochart.notice:eq(0)').children('input[type="button"]:eq(0)').val()==='Уточнить')
                            //console.log($(this).prev('.addtochart.notice:eq(0)').html());
                        //индивидуальные карточки товаров
                        //console.log($(this).prev('.price.margino:eq(0)').parent('.addchart_block_table_price:eq(0)').parent('td:first').next('td:first').children('.addchart_block_table_addtochart:eq(0)').children('.addtochart.notice:eq(0)').children('input[type="button"]:eq(0)').attr('type'));
                        if ($(this).prev('.price.margino:eq(0)').parent('.addchart_block_table_price:eq(0)').parent('td:first').next('td:first').children('.addchart_block_table_addtochart:eq(0)').children('.addtochart.notice:eq(0)').children('input[type="button"]:eq(0)').val()==='Уточнить')
                            $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');
                        
                        if ($(this).prev('.addtochart.notice:eq(0)').children('input[type="button"]:eq(0)').val()==='Уточнить')
                            $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');

                        //для каталогов типа 551    
                        if ($(this).next('.price').next('.buybuttons:eq(0)').children('.addtochart:eq(0)').children('input[type="button"]:eq(0)').val()==='Уточнить')
                            $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');
                            //console.log($(this).prev('.price:eq(0)').prev('.addtochart:eq(0)'));
                        //для заглавной страницы
                        if ($(this).parent('.price:eq(0)').prev('.addtochart:eq(0)').children('input[type="button"]:eq(0)').val()==='Уточнить')
                            $(this).html('<!--noindex-->уточняйте наличие<!--/noindex-->');                        
                    });
                }

                });
                //функция обработки части форма forma_dost для Транспортных компаний
                    function fillTKtablePart(){

                        if ($("input[name='tk_list_item']:eq(3)").length ||
                                $("#tk_other").length ||
                                $("#firstname").length ||
                                $("#middlename").length ||
                                $("#lastname").length ||
                                $("#pass_no1").length ||
                                $("#pass_no2").length ||
                                $("#pass_police").length ||
                                $("#delivery_city").length ||
                                $("#delivery_address").length ||
                                $("#postal_index").length){
                                $("#tk_other").inputmask("mask", {mask: "k{50}"});
                                $("#firstname").inputmask("mask", {mask: "l",repeat:28});//"l{28}"								
                                $("#middlename").inputmask("l{28}");
                                $("#lastname").inputmask("l{28}");								
                                if (typeof ($.browser.android) === 'undefined'){
									$("#tel2").inputmask("mask", {mask: "+7(999)999-99-99"}); //{mask: "+7(9##)###-##-##"}									
								}
                                if (typeof ($.browser.android) !== 'undefined' && $.browser.android === true){
									$("#tel2").attr("data-content", "Введите моб. телефон без восьмерки в формате: [9011234567]");
									$("#tel2").attr("placeholder", "9011234567");
									$("#tel2").attr("maxlength", "10");
								}
								$("#tel2").mouseover(function() {
									$(this).popover({placement : 'right'});
									$(this).css('border-color', '#abadb3');
								});
                                $("#tel2").mouseout(function() {
									$(this).popover('hide');
								});
                                                                $("#tel2").focusout(function(){
                        						if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}                                            
                                                                });
                                $("#pass_no1").inputmask("mask", {mask: "9999"});
                                $("#pass_no2").inputmask("mask", {mask: "999999"});
                                $("#pass_no1").inputmask("mask", {mask: "9999"});
                                $("#pass_no2").inputmask("mask", {mask: "999999"});
                                $("#postal_index").inputmask("mask", {mask: "999999"});
                                $("#pass_police").inputmask("dd.mm.yyyy");
                                $("#delivery_city").inputmask("p{55}");
                                $("#delivery_address").inputmask("b{150}");
                                $("#tk_other").focusout(function(){
                                    //console.log($("input[type=radio][name='tk_list_item']:eq(0):checked").length);
                                    if (typeof ($(this).attr('disabled')) === 'undefined' && ($("input[type=radio][name='tk_list_item']:eq(0):checked").length === 0 &&
                                                    $("input[type=radio][name='tk_list_item']:eq(1):checked").length === 0 &&
                                                    $("input[type=radio][name='tk_list_item']:eq(2):checked").length === 0)) {
                                                    var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5* -_]{3,40}$', 'ig');
                                                    //console.log(regExpr.test($(this).val()));
                                                    if (regExpr.test($(this).val()) === true) {
                                                            $(this).css('border-color', '#abadb3');
                                                    } else if (regExpr.test($(this).val()) === false) {
                                                            $(this).css('border-color', '#ff5555');
                                                    }
                                    }
                                });
                                $("#tk_other").mouseover(function() {
				$(this).popover({placement : 'top'});
				});
                                $("#tk_other").mouseout(function() {
                                    $(this).popover('hide');
				});

                                $("#firstname").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5 -_]{2,28}$', 'ig');
									//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
									if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});									
                                $("#middlename").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5 -_]{2,28}$', 'ig');
											//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#lastname").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5 -_]{2,28}$', 'ig');
											//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#pass_police").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[0-9]{2}\.[0-9]{2}\.[0-9]{4}$', 'ig');
											//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#pass_no1").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[0-9]{4}$', 'ig');
									//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#pass_no2").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[0-9]{6}$', 'ig');
									//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#delivery_city").mouseover(function() {
									$(this).popover({placement : 'right'});
								});
                                $("#delivery_city").mouseout(function() {
									$(this).popover('hide');
								});
                                $("#delivery_city").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5. -_]{2,55}$', 'ig');
									//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#postal_index").mouseover(function() {
									$(this).popover({placement : 'right'});
								});
                                $("#postal_index").mouseout(function() {
									$(this).popover('hide');
								});
                                $("#postal_index").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[0-9]{6}$', 'ig');
											//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("#delivery_address").mouseover(function() {
									$(this).popover({placement : 'top'});
								});
                                $("#delivery_address").mouseout(function() {
									$(this).popover('hide');
								});
                                $("#delivery_address").focusout(function(){
									//console.log($(this).attr('disabled'));
									//if (typeof($(this).attr('disabled'))=== 'undefined') {
									var regExpr = new RegExp('^[A-Za-z\u0410-\u044F\u0401\u0451\u00C0-\u00FF\u00B5/,. -_]{5,150}$', 'ig');
									//console.log(regExpr.test($(this).val()));
									if (regExpr.test($(this).val()) === true) {
										$(this).css('border-color', '#abadb3');
									} else if (regExpr.test($(this).val()) === false) {
										$(this).css('border-color', '#ff5555');
									}
                                                                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
										if ($(this).val().length === 0){
											$(this).css("color", "#B0B0B0");
										}
									}
									//}      
								});
                                $("input[type=radio][name='tk_list_item']").on('change', function(){
									//$('#attr_val2').text($(this).val());
									$(this).each(function(indx){
										if (($(this).val() === 'Деловые Линии' || $(this).val() === 'ПЭК' || $(this).val() === 'ЖелДор') && typeof ($('#tk_other').attr('disabled')) === 'undefined') {
											// $('#attr_val2').text(indx);
											$('#tk_other').attr('disabled', 'disabled');
											$('#tk_other').css('border-color', '#abadb3');
											$('#tk_other').val('');
										} else if ($(this).val() === 'Прочая' && typeof ($('#tk_other').attr('disabled')) === 'string'){
											//$('#attr_val2').text(indx);
											$('#tk_other').removeAttr('disabled');
										}
									});
								});
                                $("input[type=radio][name='tk_delivery_item']").on('change', function(){
								//$('#attr_val2').text($(this).val());
									$(this).each(function(indx){
										if (($(this).val() === 'до пункта выдачи ТК') && typeof ($('#delivery_address').attr('disabled')) === 'undefined') {
										// $('#attr_val2').text(indx);
										$('#delivery_address').attr('disabled', 'disabled');
												$('#delivery_address').css('border-color', '#abadb3');
												$('#delivery_address').val('');
										} else if ($(this).val() === 'по адресу' && typeof ($('#delivery_address').attr('disabled')) === 'string'){
										//$('#attr_val2').text(indx);
										$('#delivery_address').removeAttr('disabled');
										}
									});
								});

                                if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
                                    $("#firstname,#middlename,#lastname,#pass_no1,#pass_no2,#tel2,#pass_police,#delivery_city,#delivery_address,#postal_index").each (function(){
                                        $(this).css("color", "#B0B0B0");
                                        $(this).keypress(function() {
                                            if ($(this).val().length === 0)
                                                    $(this).css("color", "#B0B0B0");
                                                    else
                                                    $(this).css("color", "black");
                                        });
                                    });
                                }
                        }
					}
                    function msie_text_color_correction(elements){
                        if (typeof ($.browser.msie) !== 'undefined' && $.browser.msie === true){
                            for (element_id=0;element_id<elements.length;element_id++){
                                $(elements[element_id]).css("color", "#B0B0B0");
                                $(elements[element_id]).keypress(function() {
                                        if ($(this).val().length === 0)
                                                        $(this).css("color", "#B0B0B0");
                                                        else
                                                        $(this).css("color", "black");
                                        });
                                        $(elements[element_id]).focusout(function() {
                                        if ($(this).val().length === 0){
                                                $(this).css("color", "#B0B0B0");
                                        }
                                });
                            }
                        }
                    }
                function changeT(id){
                //$('input[name=\'colorcheck'+id+'\']:visible').attr('checked',true);
                $('#id_' + id + ' input[type=\'checkbox\']:visible').each(function(){
                $(this).attr('checked', true);
                        //showManufProduct($(this));
                        showM();
                });
                        }
                function changeF(id){
                //$('input[name=\'colorcheck'+id+'\']:visible').attr('checked',false);
                $('#id_' + id + ' input[type=\'checkbox\']:checked').each(function(){
                $(this).attr('checked', false);
                        //showManufProduct($(this));
                        showM();
                });
                        }
                function changeVonLoad(conf, id){
                $(document).ready(function(){
                conf = conf || 1;
                        if (conf == 1) {
                if (id > 0) {

                $("#id_" + id).attr("style", "height:0px");
                        $("#id_" + id).attr("style", "visibility:hidden");
                        $("#id_" + id).hide();
                        //var e = document.getElementById("id_"+id);
                        //	      e.style.height = '0px';
                        //	      e.style.visibility = 'hidden';
                }
                } else if (conf == 2) {
                $(".block_" + id).attr("style", "height:0px");
                        $(".block_" + id).attr("style", "visibility:hidden");
                        $(".block_" + id).hide();
                        $("#visible_all" + id).attr("style", "height:0px");
                        $("#visible_all" + id).attr("style", "visibility:hidden");
                        $("#visible_all_" + id).hide();
                        $("#id_" + id).attr("style", "height:0px");
                        $("#id_" + id).attr("style", "visibility:hidden");
                        $("#id_" + id).hide();
                        //var e = document.getElementById("id_"+id);
                        //	      e.style.height = '0px';
                        //	      e.style.visibility = 'hidden';		
                }
                //showM();
                });
                        }

                function changeV(id){
                var e = document.getElementById('id_' + id);
                        var style_hei = e.offsetHeight;
                        //alert(e.offsetHeight+' '+style_hei);
                        if (style_hei > 0) {
                //$("id_"+id).css("visibility", "hidden");
                //$("id_"+id).css("height", '0px');
                //e.style.height = '0px';
                $('#id_' + id).attr('style', 'height:0px');
                        $('#id_' + id).hide();
                        //e.style.visibility = 'hidden';
                        //showM();
                } else {
                //var new_class =e; // "#"+"id_"+id+" {display: block; float: none;position: static; height: 71px;font-family: Arial,Helvetica,sans-serif;font-size: 12px;line-height: 16.8px;}";
                //e.innerHTML = new_class;
                //alert('hi');
                //$("id_"+id).attr("style","visibility:visible");
                //$("id_"+id).attr("style","height:71px");
                //e.style.height = '71px';
                //check_height = $('.check').css( 'height' );
                //console.log('check_height='+check_height);
                $('#id_' + id).attr('style', 'height:100px'); //'height:120px'
                        $('#id_' + id).show();
                        //e.style.visibility = 'visible';
                        //showM();
                        //e.style.visibility = 'visible';
                        //e.style.height == '71px';
                        //document.location.reload(true);
                        //e.innerHTML=new_class;
                        //document.location.reload(true);
                }
                }

                /* product page slideshow */
                var currentImage;
                        var currentIndex = - 1;
                        var interval;
                        function showImage(index){
                        if (index < $('#bigPic img').length){
                        var indexImage = $('#bigPic img')[index]
                                if (currentImage){
                        if (currentImage != indexImage){
                        $(currentImage).css('z-index', 2);
                                clearTimeout(myTimer);
                                $(currentImage).fadeOut(250, function() {
                        myTimer = setTimeout("showNext()", 9000);
                                $(this).css({'display':'none', 'z-index':1})
                        });
                        }
                        }
                        $(indexImage).css({'display':'block', 'opacity':1});
                                currentImage = indexImage;
                                currentIndex = index;
                                $('#thumbs li').removeClass('active');
                                $($('#thumbs li')[index]).addClass('active');
                        }
                        }

                function showNext(){
                var len = $('#bigPic img').length;
                        var next = currentIndex < (len - 1) ? currentIndex + 1 : 0;
                        showImage(next);
                }

                /*    
                 var myTimer;
                 
                 $(document).ready(function() {
                 myTimer = setTimeout("showNext()", 3000);
                 showNext(); //loads first image
                 $('#thumbs li').bind('click',function(e){
                 var count = $(this).attr('rel');
                 showImage(parseInt(count)-1);
                 });
                 });
                 */

                /* product page tabs */
                /*
                 $(function () {
                 var tabContainers = $('div.tabs > div');
                 tabContainers.hide().filter(':first').show();
                 $('div.tabs ul.tabNavigation a').click(function () {
                 tabContainers.hide();
                 tabContainers.filter(this.hash).show();
                 $('div.tabs ul.tabNavigation a').removeClass('selected');
                 $(this).addClass('selected');
                 return false;
                 }).filter(':visible:first').click();
                 
                 //всплывающие подсказки в доставке при заполнении полей
                 $( "#mail" ).tooltip({ position: { my: "left+23 center", at: "right center",of: "#mail"} });
                 $( "#name_person" ).tooltip({ position: { my: "left+23 center", at: "right center",of: "#name_person"} });
                 $( "#tel_name" ).tooltip({ position: { my: "left+23 center", at: "right center",of: "#tel_name"} });	
                 
                 //функции работы с edost
                 function fillReg() {
                 var ToCity2 = $("#edost_to_city").val();
                 var weight2 = $("#edost_weight").val();
                 
                 $("#Err1").html('');
                 
                 if (ToCity1 != ToCity2) {
                 //---Находим код региона по выбранному городу---
                 var c1 = -1;
                 var i;
                 for (i=0; i<cit.length;i++){ if (cit[i]==ToCity2) {c1 = k[i]; break;} }
                 if (c1 == -1) $("#ToReg").html('-');
                 else $("#ToReg").html(r[c1]);
                 
                 $("#edost_weight").focus();
                 }
                 }
                 
                 function findValueCallback(event, data) {
                 fillReg();
                 }
                 
                 $("#edost_to_city").autocomplete({source:cit,change: function( event, ui ) {fillReg();}});
                 
                 
                 });
                 */
                function load_(){
                $.ajax({
                url: '/geo_engine.php',
                        type: 'post',
                        data: 'a=1',
                        dataType: 'json',
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){

                        html = '<div id="light_box"><div class="popup_region"><div><span class="popup_title">Ваш регион:</span>';
                                if (json['city'] == '1'){
                        html += '<span class="select_region"><b>Санкт-Петербург</b></span><a class="popup_ok" onclick="save_(\'spb\')" title="OK">OK</a></div>';
                        } else if (json['city'] == '2'){
                        html += '<span class="select_region"><b>Чебоксары</b></span><a class="popup_ok" onclick="save_(\'chb\')" title="OK">OK</a></div>';
                        } else if (json['city'] == '3'){
                        html += '<span class="select_region"><b>Другой регион</b></span><a class="popup_ok" onclick="save_(\'other\')" title="OK">OK</a></div>';
                        } else if (json['city'] == '0'){
                        html += '<span class="select_region"><b>Москва</b></span><a class="popup_ok" onclick="save_(\'msc\')" title="OK">OK</a></div>';
                        }

                        html += '<div class="popup_hint">Если регион выбран неверно — выберите свой:</div>';
                                html += '<a class="popup_moscow ' + json['actclass1'] + '" onclick="save_(\'msc\')" title="Москва">Москва</a>';
                                html += '<a class="popup_spb ' + json['actclass2'] + '" onclick="save_(\'spb\')" title="Санкт-Петербург">Санкт-Петербург</a>';
                                html += '<a class="popup_chb ' + json['actclass3'] + '" onclick="save_(\'chb\')" title="Чебоксары">Чебоксары</a>';
                                html += '<a class="popup_else ' + json['actclass4'] + '" onclick="save_(\'other\')"  title="Другой регион">Другой регион</a></div></div>';
                                $('#footer').after(html);
                        }
                        }

                });
                        }

                function save_(reg){
                $.ajax({
                url: '/set_region.php',
                        type: 'post',
                        data: 'reg=' + reg,
                        dataType: 'json',
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        $('#light_box').remove();
                        //if (from===false){
                        location.reload();
                        //} else {
                        //location.assign(location.href+'#tab7');
                        //}
                        //if ($('#edost_to_city').length && reg === 'spb') {
                        //$('#edost_to_city').val("Санкт-Петербург");
                        //$("#edost_to_city").click();
                        //console.log($("#edost_to_city").val());
                        //} else if ($('#edost_to_city').length && reg !== 'spb') {
                        $('#edost_to_city').val("");
                        //$("#edost_to_city").click();
                        //console.log($("#edost_to_city").val());
                        //}
                        if ($('#edost_zip').length) {
                        $('#edost_zip').val("");
                        //$("#edost_to_city").click();
                        }
                        },
                        error: function(jqXHR, textStatus, errorThrown) {
                        console.log('error save_(reg)' + ' ' + textStatus);
                        }
                });
                        }
                function save2_(reg){
                $.ajax({
                url: '/set_region.php',
                        type: 'post',
                        data: 'reg=' + reg,
                        dataType: 'json',
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        $('#light_box').remove();
                        //if (from===false){
                        location.hash='tab7';
                        location.reload();
                        //} else {
                        //location.assign(location.href+'#tab7');
                        //}
                        //if ($('#edost_to_city').length && reg === 'spb') {
                        //$('#edost_to_city').val("Санкт-Петербург");
                        //$("#edost_to_city").click();
                        //console.log($("#edost_to_city").val());
                        //} else if ($('#edost_to_city').length && reg !== 'spb') {
                        $('#edost_to_city').val("");
                        //$("#edost_to_city").click();
                        //console.log($("#edost_to_city").val());
                        //}
                        if ($('#edost_zip').length) {
                        $('#edost_zip').val("");
                        //$("#edost_to_city").click();
                        }
                        },
                        error: function(jqXHR, textStatus, errorThrown) {
                        console.log('error save_(reg)' + ' ' + textStatus);
                        }
                });
                        }

                function fast_order_window(my_url, referer_info){
                $.ajax({
                url: '/fast_order.php',
                        type: 'post',
                        data: 'url=' + my_url,
                        dataType: 'json',
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){
                        html = '<div id="light_box"><div class="fast_order_window"><div class="popup_region">';
                                html += '<form id="fast_order_form" action="http://prodacha.ru/snip_call.php" method="POST">';
                                html += '<input type="button" id="fast_order_close_button" onclick="close_fast_order();"/>';
                                html += '<div id="fast_order_window_item1"><b>' + json['item1'] + '</b></div>';
                                html += '<div id="fast_order_window_item2">' + json['item2'] + '</div>';
                                html += '<div id="fast_order_window_item3">' + json['item3'] + '</div>';
                                html += '<div id="fast_order_window_item4">' + json['item4'] + '</div>';
                                html += '<div id="fast_order_window_item5">' + json['item5'] + '</div>';
                                html += '<div class="tovar_info" name="tovar_info">';
                                if ((json['item6'].length + json['item7'].length + json['item8'].length) > 80) {
                        font_size = 'style="font-size:12px;"';
                                yo_name_top = 'style="margin-top:14px;"';
                                yo_phone_top = 'style="margin-top:16px;"';
                                popup_ok_top = 'style="margin-top:-60px;"';
                        } if ((json['item6'].length + json['item7'].length + json['item8'].length) < 49) {
                        font_size = 'style="font-size:14px;"';
                                yo_name_top = 'style="margin-top:18px;"';
                                yo_phone_top = 'style="margin-top:20px;"';
                                popup_ok_top = 'style="margin-top:-70px;"';
                        } else {
                        font_size = 'style="font-size:13px;"';
                                yo_name_top = 'style="margin-top:11px;"';
                                yo_phone_top = 'style="margin-top:13px;"';
                                popup_ok_top = 'style="margin-top:-70px;"';
                        }
                        html += '<div id="fast_order_window_item6" name="fast_order_window_item6"' + font_size + '><b>' + json['item6'] + '&nbsp;-&nbsp;</b></div>';
                                html += '<div id="fast_order_window_item7" name="fast_order_window_item7"' + font_size + '><b>' + json['item7'] + '</b>&nbsp;</div>';
                                html += '<div id="fast_order_window_item8" name="fast_order_window_item8"' + font_size + '><b>' + json['item8'] + '</b>&nbsp;</div>';
                                html += '</div>';
                                html += '<input type="text"' + yo_name_top + ' id="yo_name" name="yo_name" onblur="checkresult_value(this);" value="" placeholder="Имя" pattern="^[\-A-Za-z\u0410-\u044F]+$" />';
                                html += '<input type="tel" ' + yo_phone_top + ' id="yo_phone" name="yo_phone" onblur="checkresult_value(this);" value="" placeholder="+79101234567" pattern="^[\+0-9]{7,12}$" />';
                                //html +=	'<div id="yo_phone_caption">+79051323232</div>';			
                                html += '<input id="cv3" type="hidden" name="cv3" value="nohspamcode" />';
                                html += '<script type="text/javascript">';
                                html += '$(document).ready(function() {';
                                html += '$("#cv3").val="nohspamcode";';
                                //html += '$("#fade").click( function(e) {';
                                //html += 'alert("e.pageX = " + e.pageX + ", e.pageY = " + e.pageY);';
                                //html += 'if (typeof(e.pageX)=="undefined" && typeof(e.pageY)=="undefined" ) {';
                                //html += '$("#light_box").remove();';
                                //html += '}';
                                html += '});';
                                html += '});';
                                html += '</script>';
                                html += '<div class="in_fast_order_window">';
                                html += '<input type="button" ' + popup_ok_top + ' class="popup_ok" id="fast_order_ok" value="OK" onclick="check_fast_order_values();"/>'; //onclick="check_fast_order_values()"			
                                html += '</div>';
                                html += '<input type="hidden" id="referer_info" name="referer_info" value="' + referer_info[0].innerHTML + '" />';
                                html += '<input type="hidden" name="tovar_info_input" value="' + json['item6'] + '&nbsp;-&nbsp;' + json['item7'] + '&nbsp;' + json['item8'] + '" />';
                                html += '</form> </div></div></div>';
                                $('#footer').after(html);
                                html = '<script type="text/javascript">';
                                html += 'var netref=document.getElementsByClassName("netref");';
                                html += 'document.getElementById("referer_info").value=netref[0].value;';
                                html += '</script>';
                                $('#footer').after(html);
                        }
                        }
                });
                        }

                function fast_order_window2(my_url, referer_info) {
                $.ajax({
                url: '/fast_order.php',
                        type: 'post',
                        data: 'url=' + my_url,
                        dataType: 'json',
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){
                        html = '<div class="fast_order_window_iframe" style"margin:10px,5px,5px,5px;">';
                        html += '<form id="fast_order_form" action="http://prodacha.ru/snip_call.php" method="POST">';
                        html += '<div id="fast_order_window_item1" style="position:relative;top: 25px;left: 10px;font-size:18px;width:150px;"><b>' + json['item1'] + '</b></div>';
                        html += '<div id="fast_order_window_item2" style="position:relative;top: 70px;left: 10px;font-size:20px;">' + json['item2'] + '</div>';
                        if ((json['item6'].length + json['item7'].length + json['item8'].length) < 60) {
                            yo_name_top_comment = 85;
                        } else
                        if ((json['item6'].length + json['item7'].length + json['item8'].length) > 100) {
                            yo_name_top_comment = 85;
                        } else {
                            yo_name_top_comment = 85;
                        }
                        html += '<div id="fast_order_window_item3" style="position:relative;top: ' + (yo_name_top_comment + 5).toString() + 'px;left: 10px;font-size:20px;">' + json['item3'] + '</div>';
                                html += '<div id="fast_order_window_item4" style="position:relative;top: ' + (yo_name_top_comment + 25).toString() + 'px;left: 10px;font-size:20px;">' + json['item4'] + '</div>';
                                html += '<div id="fast_order_window_item5" style="position:relative;margin-top: -80px;margin-left: 160px;font-size:12px;width:400px;word-wrap: break-word;">' + json['item5'] + '</div>';
                                html += '<div class="tovar_info" name="tovar_info" style="position:relative;width:430px !Important;height:70px;left:160px;top:35px;word-wrap: break-word;">';
                                if ((json['item6'].length + json['item7'].length + json['item8'].length) < 60) {
                        font_size = 'style="font-size:14px;position:relative;display:inline;width:430px !Important;height:70px;left:0px;top:0px;word-wrap: break-word;"';
                                yo_name_top = 'style="position: relative;left: 0px;top: 35px;width:180px;height:25px;font-size:17px;"';
                                yo_phone_top = 'style="position: relative;left: 0px;top: 55px;width:180px;height:25px;font-size:17px;"';
                                popup_ok_top = 'style="position: relative;left: 460px;top: -35px;border: none;width:105px;height:50px;padding: 5px 5px 25px 5px !important;"';
                        } else if ((json['item6'].length + json['item7'].length + json['item8'].length) > 100) {
                        font_size = 'style="font-size:12px;position:relative;display:inline;width:450px !Important;height:70px;left:0px;top:0px;word-wrap: break-word;"';
                                yo_name_top = 'style="position: relative;left: 0px;top: 35px;width:180px;height:25px;font-size:17px;"';
                                yo_phone_top = 'style="position: relative;left: 0px;top: 55px;width:180px;height:25px;font-size:17px;"';
                                popup_ok_top = 'style="position: relative;left: 460px;top: -35px;border: none;width:105px;height:50px;padding: 5px 5px 25px 5px !important;"';
                        } else {
                        font_size = 'style="font-size:13px;position:relative;display:inline;width:430px !Important;height:70px;left:0px;top:0px;word-wrap: break-word;"';
                                yo_name_top = 'style="position: relative;left: 0px;top: 35px;width:180px;height:25px;font-size:17px;"';
                                yo_phone_top = 'style="position: relative;left: 0px;top: 55px;width:180px;height:25px;font-size:17px;"';
                                popup_ok_top = 'style="position: relative;left: 460px;top: -35px;border: none;width:105px;height:50px;padding: 5px 5px 25px 5px !important;"';
                        }
                        html += '<div id="fast_order_window_item6" name="fast_order_window_item6"' + font_size + '><b>' + json['item6'] + ' - ' + json['item7'] + ' ' + json['item8'] + '</b></div>';
                                html += '</div>';
                                html += '<div class="user_info" style="position:relative;top:-20px;left:160px;width:260px;height:80px;">';
                                html += '<input type="text"' + yo_name_top + ' id="yo_name" name="yo_name" onblur="checkresult_value(this);" value="" placeholder="Имя" pattern="^[\-A-Za-z\u0410-\u044F]+$" maxlength="100"/>';
                                html += '<input type="tel" ' + yo_phone_top + ' id="yo_phone" name="yo_phone" onblur="checkresult_value(this);" value="" placeholder="+79101234567" pattern="^[\+0-9]{7,12}$" maxlength="12"/>';
                                html += '</div>';
                                html += '<input id="cv3" type="hidden" name="cv3" value="nohspamcode" />';
                                html += '<div class="in_fast_order_window">';
                                html += '<input type="button" ' + popup_ok_top + ' class="popup_ok" id="fast_order_ok" value="OK" onclick="check_fast_order_values(1);"/>'; //onclick="check_fast_order_values()"			
                                html += '</div>';
                                html += '<input type="hidden" id="referer_info" name="referer_info" value="' + referer_info[0].innerHTML.toString().trim() + '" />';
                                html += '<input type="hidden" name="tovar_info_input" value="' + json['item6'] + ' - ' + json['item7'] + ' ' + json['item8'] + '" />';
                                html += '<input type="hidden" name="region" value="' + json['item9'] + '" />';
                                html += '<input type="hidden" name="zakaz_info" value="' + json['item1'] + '" />';
                                html += '<input type="hidden" name="tovar_price" value="' + json['item7'] + ' ' + json['item8'] + '" />';
                                html += '<input type="hidden" name="tovar_price_short" value="' + json['item7'] + '" />';
                                html += '<input type="hidden" name="tovar_id" value="' + json['item10'] + '" />';
                                html += '<input type="hidden" name="transact_id" value="' + json['item11'] + '" />';
                                html += '</form></div>';
                                //ga('send', 'event', 'buy-fast', 'click');
                                ga('send', 'pageview', '/buy-fast/open');
                                ga('send', 'pageview');
                                //console.log('buy-fast.click');		

                                var url = 'http://prodacha.ru/fast_order_window.php';
                                $.fancybox
                                ({
                                width : 600,
                                        height : 240,
                                        overlayOpacity:0,
                                        autoSize:false,
                                        type: 'iframe',
                                        href: url,
                                        content: html,
                                        scrolling: 'no',
                                        helpers : {
                                        overlay : {
                                        css : { 'overflow' : 'hidden' }
                                        }}
                                });
                        }
                        }
                });
                        }

                function ask_product_availability(my_url, referer_info) {
                $.ajax({
                url: '/ask_product_availability.php',
                        type: 'post',
                        data: 'url=' + my_url,
                        dataType: 'json',
                        error: function (request, error) {
                        console.log(arguments);
                                alert(" Ошибка ajax: " + error);
                        },
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){
                        html = '<div class="fast_order_window_iframe">'; //style="margin:10px,5px,5px,5px;"
                                html += '<form id="fast_order_form" action="http://prodacha.ru/snip_call.php" method="POST">';
                                html += '<div id="fast_order_window_item1" style="position:relative;top: 25px;left: 10px;font-size:16px;width:150px;"><b>' + json['item1'] + '</b></div>';
                                html += '<div id="fast_order_window_item5" style="position:relative;margin-top: 7px;margin-left: 160px;font-size:12px;width:400px;word-wrap: break-word;">' + json['item5'] + '</div>';
                                html += '<div id="fast_order_window_item2" style="position:relative;top: 20px;left: 10px;font-size:20px;width:150px">' + json['item2'] + '</div>';
                                if ((json['item6'].length + json['item7'].length + json['item8'].length) < 60) {
                        yo_name_top_comment = 25;
                        } else
                                if ((json['item6'].length + json['item7'].length + json['item8'].length) > 100) {
                        yo_name_top_comment = 25;
                        } else {
                        yo_name_top_comment = 25;
                        }

                        html += '<div id="fast_order_window_item3" style="position:relative;top: ' + (yo_name_top_comment + 13).toString() + 'px;left: 10px;font-size:20px;width:150px">' + json['item3'] + '</div>';
                                html += '<div id="fast_order_window_item4" style="position:relative;top: ' + (yo_name_top_comment + 23).toString() + 'px;left: 10px;font-size:20px;width:150px">' + json['item4'] + '</div>';
                                html += '<div id="ask_product_availability_item2" style="position:relative;top: ' + (yo_name_top_comment + 33).toString() + 'px;left: 10px;font-size:20px;width:150px">' + json['item10'] + '</div>';
                                html += '<div class="tovar_info" name="tovar_info" style="position:relative;width:430px !Important;height:70px;left:160px;top:-65px;word-wrap: break-word;">';
                                if ((json['item6'].length + json['item7'].length + json['item8'].length) < 60) {
                        font_size = 'style="font-size:14px;position:relative;display:inline;width:430px !Important;height:70px;left:0px;top:-30px;word-wrap: break-word;"';
                                yo_name_top = 'style="position: relative;left: 0px;top: -100px;width:180px;height:25px;font-size:17px;"';
                                yo_phone_top = 'style="position: relative;left: 0px;top: -88px;width:180px;height:25px;font-size:17px;"';
                                yo_mail_top = 'style="position: relative;left: 0px;top: -75px;width:180px;height:25px;font-size:17px;"';
                                popup_ok_top = 'style="position: relative;left: 460px;top: -145px;border: none;width:105px;height:50px;padding: 5px 5px 25px 5px !important;"';
                        } else if ((json['item6'].length + json['item7'].length + json['item8'].length) > 100) {
                        font_size = 'style="font-size:12px;position:relative;display:inline;width:450px !Important;height:70px;left:0px;top:-30px;word-wrap: break-word;"';
                                yo_name_top = 'style="position: relative;left: 0px;top: -100px;width:180px;height:25px;font-size:17px;"';
                                yo_phone_top = 'style="position: relative;left: 0px;top: -88px;width:180px;height:25px;font-size:17px;"';
                                yo_mail_top = 'style="position: relative;left: 0px;top: -75px;width:180px;height:25px;font-size:17px;"';
                                popup_ok_top = 'style="position: relative;left: 460px;top: -145px;border: none;width:105px;height:50px;padding: 5px 5px 25px 5px !important;"';
                        } else {
                        font_size = 'style="font-size:13px;position:relative;display:inline;width:430px !Important;height:70px;left:0px;top:-30px;word-wrap: break-word;"';
                                yo_name_top = 'style="position: relative;left: 0px;top: -100px;width:180px;height:25px;font-size:17px;"';
                                yo_phone_top = 'style="position: relative;left: 0px;top: -88px;width:180px;height:25px;font-size:17px;"';
                                yo_mail_top = 'style="position: relative;left: 0px;top: -75px;width:180px;height:25px;font-size:17px;"';
                                popup_ok_top = 'style="position: relative;left: 460px;top: -145px;border: none;width:105px;height:50px;padding: 5px 5px 25px 5px !important;"';
                        }
                        html += '<div id="fast_order_window_item6" name="fast_order_window_item6"' + font_size + '><b>' + json['item6'] + ' - ' + json['item7'] + ' ' + json['item8'] + '</b></div>';
                                html += '</div>';
                                html += '<div class="user_info" style="position:relative;top:-20px;left:160px;width:260px;height:80px;">';
                                html += '<input type="text" ' + yo_name_top + ' id="yo_name" name="yo_name" onblur="checkresult_value(this);" value="" placeholder="Имя" pattern="^[\-A-Za-z\u0410-\u044F]+$" maxlength="100"/>';
                                html += '<input type="tel" ' + yo_phone_top + ' id="yo_phone" name="yo_phone" onblur="checkresult_value(this);" value="" placeholder="+79101234567" pattern="^[\+0-9]{7,12}$" maxlength="12"/>';
                                html += '<input type="text" ' + yo_mail_top + ' id="yo_mail" name="yo_mail" onblur="checkresult_value(this);" value="" placeholder="ivan@prodacha.ru" pattern="^[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?$" maxlength="100"/>';
                                html += '</div>';
                                html += '<input id="cv3" type="hidden" name="cv3" value="nohspamcode" />';
                                html += '<div class="in_fast_order_window">';
                                html += '<input type="button" ' + popup_ok_top + ' class="popup_ok" id="fast_order_ok" value="OK" onclick="check_fast_order_values(2);"/>'; //onclick="check_fast_order_values()"
                                html += '</div>';
                                html += '<input type="hidden" id="referer_info" name="referer_info" value="' + referer_info[0].innerHTML.toString().trim() + '" />';
                                html += '<input type="hidden" name="tovar_info_input" value="' + json['item6'] + ' - ' + json['item7'] + ' ' + json['item8'] + '" />';
                                html += '<input type="hidden" name="region" value="' + json['item9'] + '" />';
                                html += '<input type="hidden" name="zakaz_info" value="' + json['item1'] + '" />';
                                html += '<input type="hidden" name="tovar_price" value="' + json['item7'] + ' ' + json['item8'] + '" />';
                                html += '</form></div>';
                                var script = document.createElement("script");
                                script.type = "text/javascript";
                                script.text = "ga('send', 'event', 'utochnit', 'open');ga('send', 'pageview', '/utochnit/open');ga('send', 'pageview');"; // use this for inline script
                                //script.text  += "console.log('utochnit.open');";
                                document.body.appendChild(script);
                                // remove from the dom
                                document.body.removeChild(document.body.lastChild);
                                var url = 'http://prodacha.ru/ask_product_availability_window.php';
                                $.fancybox
                                ({
                                width : 600,
                                        height : 240,
                                        overlayOpacity:0,
                                        autoSize:false,
                                        type: 'iframe',
                                        href: url,
                                        content: html,
                                        scrolling: 'no',
                                        helpers : {
                                        overlay : {
                                        css : { 'overflow' : 'hidden' }
                                        }}
                                });
                        }
                        }
                });
                        }

                function close_fast_order() {
                $('#light_box').remove();
                        }

                function ask_reverse_call(referer_info) {

                $.ajax({
                url: '/ask_reverse_call.php',
                        type: 'post',
                        data: 'a=1',
                        dataType: 'json',
                        error: function (request, error) {
                        console.log(arguments);
                                alert(" Ошибка ajax: " + error);
                        },
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){
                        console.log('ask_reverse_call');
                                html = '<div class="fast_order_window_iframe">';
                                html += '<form id="fast_order_form" action="http://prodacha.ru/snip_call.php" method="POST">';
                                html += '<div id="fast_order_window_item1" style="position: absolute; font-size: 16px; width: 150px; display: inline; left: 10px; top: 25px;"><b>' + json['item1'] + '</b></div>';
                                html += '<div id="fast_order_window_item5" style="position: absolute; font-size: 16px; width: 400px; word-wrap: break-word; display: inline-block; left: 180px; top: 25px;">' + json['item5'] + '</div>';
                                html += '<div id="fast_order_window_item3" style="position: absolute; top: 80px; left: 10px; font-size: 20px; width: 150px; display: inline;">Ваше имя:</div>';
                                html += '<div id="fast_order_window_item4" style="position: absolute; top: 120px; left: 10px; font-size: 20px; width: 150px; display: inline;">Ваш телефон:</div>';
                                html += '<input type="text" style="position: absolute; left: 180px; top: 80px; width: 180px; height: 25px; font-size: 17px;" id="yo_name" name="yo_name" onblur="checkresult_value(this);" value="" placeholder="Имя" pattern="^[-A-Za-zА-я]+$" maxlength="100">';
                                html += '<input type="tel" style="position: absolute; left: 180px; top: 120px; width: 180px; height: 25px; font-size: 17px;" id="yo_phone" name="yo_phone" onblur="checkresult_value(this);" value="" placeholder="+79101234567" pattern="^[+0-9]{7,12}$" maxlength="12">';
                                html += '<div id="fast_order_window_item2" style="position: absolute; top: 160px; left: 10px; font-size: 20px; width: 150px; display: inline;">Время звонка:</div>';
                                html += '<div id="fast_order_window_item6" style="position: absolute; top: 160px; left: 180px; font-size: 20px; width: 20px; display: inline;">с</div>';
                                html += '<select id="yo_start_hour" name="yo_start_hour" style="position: absolute; top: 160px; left: 210px; font-size: 20px; width: 50px; display: inline;">';
                                html += '<option>10</option>';
                                html += '<option>11</option>';
                                html += '<option>12</option>';
                                html += '<option>13</option>';
                                html += '<option>14</option>';
                                html += '<option>15</option>';
                                html += '<option>16</option>';
                                html += '<option>17</option>';
                                html += '<option>18</option>';
                                html += '</select>';
                                html += '<div id="fast_order_window_item7" style="position: absolute; top: 162px; left: 270px; font-size: 20px; width: 20px; display: inline;">до</div>';
                                html += '<select id="yo_end_hour" name="yo_end_hour" style="position: absolute; top: 162px; left: 300px; font-size: 20px; width: 50px; display: inline;">';
                                html += '<option>10</option>';
                                html += '<option>11</option>';
                                html += '<option>12</option>';
                                html += '<option>13</option>';
                                html += '<option>14</option>';
                                html += '<option>15</option>';
                                html += '<option>16</option>';
                                html += '<option>17</option>';
                                html += '<option selected>18</option>';
                                html += '</select>';
                                html += '<div id="fast_order_window_item8" style="position: absolute; top: 202px; left: 10px; font-size: 20px; width: 150px; display: inline;">Сообщение:</div>';
                                //html+=	'<input type="text" style="position: absolute; left: 180px; top: 202px; width: 280px; height: 65px; font-size: 12px;" id="yo_question" name="yo_question" maxlength="1000">';
                                html += '<textarea form="fast_order_form" style="position: absolute; left: 180px; top: 202px; width: 280px; height: 65px; font-size: 12px;color:#a9a9ab;" id="yo_question" name="yo_question" rows="3" cols="30" value="Вопрос" onfocus="if(this.value==\'Вопрос\'){this.value=\'\';} this.style.color=\'#000000\';" onblur="if(this.value==\'\'){this.value=\'Вопрос\';this.style.color=\'#a9a9ab\';}">Вопрос</textarea>';
                                html += '<input id="cv3" type="hidden" name="cv3" value="nohspamcode"><div class="in_fast_order_window">';
                                html += '<input type="button" style="position: absolute; left: 485px; top: 215px; border: none; width: 105px; height: 50px; padding: 5px 5px 25px 5px !important;" class="popup_ok" id="fast_order_ok" value="OK" onclick="check_fast_order_values(1);"></div>';
                                html += '<input type="hidden" id="referer_info" name="referer_info" value="' + referer_info[0].innerHTML.toString().trim() + '" />';
                                html += '<input type="hidden" name="region" value="' + json['item9'] + '" />';
                                html += '<input type="hidden" name="zakaz_info" value="' + json['item1'] + '" /></form></div>';
                                var url = 'http://prodacha.ru/ask_reverse_call_window.php';
                                $.fancybox
                                ({
                                width : 600,
                                        height : 280,
                                        overlayOpacity:0,
                                        autoSize:false,
                                        type: 'iframe',
                                        href: url,
                                        content: html,
                                        scrolling: 'no',
                                        helpers : {
                                        overlay : {
                                        css : { 'overflow' : 'hidden' }
                                        }}
                                });
                        }
                        }
                });
                        }

                function check_fast_order_values(caller) {
                if (caller == 1) {
                var yo_nameRegularIssue = false;
                        var yo_phoneRegularIssue = false;
                        if ($('#yo_name').val() == '' && $('#yo_phone').val() == '') {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя,телефон.');
                        return false;
                } else if ($('#yo_name').val() == '' && $('#yo_phone').val() != '') {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя.');
                        return false;
                } else if ($('#yo_name').val() != '' && $('#yo_phone').val() == '') {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: телефон.');
                        return false;
                } else {
                field = document.getElementById('yo_name');
                        var regExpr = new RegExp('^[\-A-Za-z\u0410-\u044F]+$', 'ig');
                        if (regExpr.test(field.value) === false) {
                yo_nameRegularIssue = true;
                } else {
                yo_nameRegularIssue = false;
                }

                field = document.getElementById('yo_phone');
                        var regExpr = new RegExp('^[\+0-9]{7,12}$', 'ig');
                        if (regExpr.test(field.value) === false) {
                yo_phoneRegularIssue = true;
                } else {
                yo_phoneRegularIssue = false;
                }

                //console.log(yo_nameRegularIssue,yo_phoneRegularIssue,yo_mailRegularIssue);
                if (yo_nameRegularIssue === true && yo_phoneRegularIssue === true) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя (Имя должно содержать только буквы), Телефон (номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента).");
                        return false;
                } else if (yo_nameRegularIssue === true && yo_phoneRegularIssue === false) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя (Имя должно содержать только буквы).");
                        return false;
                } else if (yo_nameRegularIssue === false && yo_phoneRegularIssue === true) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Телефон (номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента).");
                        return false;
                } else if (yo_nameRegularIssue === false && yo_phoneRegularIssue === false) {
                if (typeof document.getElementById("fast_order_form") != 'undefined') {
                //ga('send', 'pageview', '/buy-fast/success'); 
                //ga('send', 'pageview');
                //console.log('/buy-fast/success');
                document.getElementById("fast_order_form").submit();
                }
                //$('#light_box').remove();
                return true;
                }

                }
                }

                if (caller == 2) {
                var yo_nameRegularIssue = false;
                        var yo_phoneRegularIssue = false;
                        var yo_mailRegularIssue = false;
                        if ($('#yo_name').val() == '' && $('#yo_phone').val() == '' && $('#yo_mail').val() == '') {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя,телефон,Email.');
                        return false;
                } else if (($('#yo_name').val() == '' && $('#yo_phone').val() != '' && $('#yo_mail').val() != '')) {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя.');
                        return false;
                } else if (($('#yo_name').val() != '' && $('#yo_phone').val() == '' && $('#yo_mail').val() == '')) {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: телефон,Email.');
                        return false;
                } else if (($('#yo_name').val() == '' && $('#yo_phone').val() != '' && $('#yo_mail').val() == '')) {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя,Email.');
                        return false;
                } else if (($('#yo_name').val() == '' && $('#yo_phone').val() == '' && $('#yo_mail').val() != '')) {
                alert('Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя,телефон.');
                        return false;
                } else {
                field = document.getElementById('yo_name');
                        var regExpr = new RegExp('^[\-A-Za-z\u0410-\u044F]+$', 'ig');
                        if (regExpr.test(field.value) === false) {
                yo_nameRegularIssue = true;
                } else {
                yo_nameRegularIssue = false;
                }

                field = document.getElementById('yo_phone');
                        var regExpr = new RegExp('^[\+0-9]{7,12}$', 'ig');
                        if (regExpr.test(field.value) === false) {
                yo_phoneRegularIssue = true;
                } else {
                yo_phoneRegularIssue = false;
                }

                field = document.getElementById('yo_mail');
                        var regExpr = new RegExp('^[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?', 'ig');
                        if (regExpr.test(field.value) === false) {
                yo_mailRegularIssue = true;
                } else {
                yo_mailRegularIssue = false;
                }
                //console.log(yo_nameRegularIssue,yo_phoneRegularIssue,yo_mailRegularIssue);
                if (yo_nameRegularIssue === true && yo_phoneRegularIssue === true && yo_mailRegularIssue === true) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя (Имя должно содержать только буквы), Телефон (номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента), Email (должен быть в формате вида xxxx@xxx.xx).");
                        return false;
                } else if (yo_nameRegularIssue === true && yo_phoneRegularIssue === false && yo_mailRegularIssue === false) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя (Имя должно содержать только буквы).");
                        return false;
                } else if (yo_nameRegularIssue === false && yo_phoneRegularIssue === true && yo_mailRegularIssue === false) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Телефон (номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента).");
                        return false;
                } else if (yo_nameRegularIssue === false && yo_phoneRegularIssue === true && yo_mailRegularIssue === true) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Телефон (номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента), Email (должен быть в формате вида xxxx@xxx.xx).");
                        return false;
                } else if (yo_nameRegularIssue === true && yo_phoneRegularIssue === true && yo_mailRegularIssue === false) {
                alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Имя (Имя должно содержать только буквы), Телефон (номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента).");
                        return false;
                        /*} else if (yo_nameRegularIssue===false && yo_phoneRegularIssue===true && yo_mailRegularIssue===false) {
                         alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Телефон (Номер должен быть в формате +[xxx]код страны [xxx]код оператора [xxxxxxx]  номер абонента).");
                         return true;
                         } else if (yo_nameRegularIssue==false && yo_phoneRegularIssue==false && yo_mailRegularIssue==true) {
                         alert("Возникла ошибка. Пожалуйста проверьте вводимые данные: Email (должен быть в формате вида xxxx@xxx.xx).");
                         return true;
                         */
                } else if ((yo_nameRegularIssue === false && yo_phoneRegularIssue === false && yo_mailRegularIssue === true) || (yo_nameRegularIssue === false && yo_phoneRegularIssue === false && yo_mailRegularIssue === false)) {
                //(yo_nameRegularIssue===false && yo_phoneRegularIssue===true && yo_mailRegularIssue===false) ||
                //if ($('#stihl_window_iframe').length) $('#stihl_window_iframe').hide();
                //if ($('#fast_order_window_iframe').length) $('#fast_order_window_iframe').hide();
                if (typeof document.getElementById("fast_order_form") != 'undefined') document.getElementById("fast_order_form").submit();
                        var script = document.createElement("script");
                        script.type = "text/javascript";
                        script.text = "ga('send', 'event', 'utochnit', 'submit');ga('send', 'pageview', '/utochnit/submit');ga('send', 'pageview');"; // use this for inline script
                        //script.text  += "console.log('utochnit.submit');";              // use this for inline script
                        document.body.appendChild(script);
                        // remove from the dom
                        document.body.removeChild(document.body.lastChild);
                        return true;
                }
                }
                }
                }

                function checkresult_value(field) {

                if (field.id == 'yo_name') {
                var regExpr = new RegExp('^[\-A-Za-z\u0410-\u044F]+$', 'ig');
                }
                if (field.id == 'yo_phone') {
                var regExpr = new RegExp('^[\+0-9]{7,12}$', 'ig');
                }
                if (field.id == 'yo_phone') {
                var regExpr = new RegExp('^[\+0-9]{7,12}$', 'ig');
                }
                return regExpr;
                        }

                function stihl_window(region_info, my_url, referer_info) {
                //console.log('{reg_info:"'+region_info+'",my_url:"'+my_url+'"}');
                $.ajax({
                url: '/stihl_window.php',
                        type: 'post',
                        data: 'reg_info=' + region_info + '&my_url=' + my_url,
                        dataType: 'json',
                        error: function (request, error) {
                        //console.log(arguments);
                        alert(" Ошибка ajax: " + error);
                        },
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){

                        html = '<div class="stihl_window_iframe">'; //<div id="light_box"><div class="stihl_window"><div class="popup_region">
                        html += '<input type="button" id="stihl_window_close_button" onclick="close_stihl_window();"/>';
                        html += '<div id="stihl_window_img1"></div>';
                        html += '<div id="stihl_window_string1">' + json['item1'] + '</div>';
                        html += '<div id="stihl_window_img2"></div>';
                        html += '<div id="stihl_window_string2">' + json['item2'] + '</div>';
                        html += '<div id="stihl_window_string3">' + json['item3'] + '</div>';
                        html += '<form id="fast_order_form" action="http://prodacha.ru/snip_call.php" method="POST">';
                        //html +=	'<div id="fast_order_window_item1" style="position:relative;top: 25px;left: 10px;font-size:16px;width:150px;"><b>'+json['item1_1']+'</b></div>';
                        //html +=	'<div id="fast_order_window_item5" style="position:relative;margin-top: 7px;margin-left: 160px;font-size:12px;width:400px;word-wrap: break-word;">'+json['item5_1']+'</div>';
                        html += '<div id="fast_order_window_item2" style="position:relative;top:20px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item2_1'] + '</div>';
                        if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) < 60) {
                            yo_name_top_comment = 20;
                        } else
                        if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) > 100) {
                            yo_name_top_comment = 20;
                        } else {
                            yo_name_top_comment = 20;
                        }
                        //
                        html += '<div id="fast_order_window_item3" style="position:relative;top: ' + (yo_name_top_comment + 20).toString() + 'px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item3_1'] + '</div>';
                        html += '<div id="fast_order_window_item4" style="position:relative;top: ' + (yo_name_top_comment + 30).toString() + 'px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item4_1'] + '</div>';
                        html += '<div id="ask_product_availability_item2" style="position:relative;top: ' + (yo_name_top_comment + 40).toString() + 'px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item10_1'] + '</div>';
                        html += '<div class="tovar_info" name="tovar_info" style="position:relative;width:530px !Important;height:40px;left:160px;top:-65px;word-wrap: break-word;">';
                        if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) < 60) {
                                font_size = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position:relative;display:inline;width:490px !Important;height:40px;left:0px;top:0px;word-wrap: break-word;"';
                                yo_name_top = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -93px;width:180px;height:22px;"';
                                yo_name_top_comment = 'style="position: relative;left: 0px;top: -93px;width:80px;height:22px;"';
                                yo_phone_top = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -87px;width:180px;height:22px;"';
                                yo_phone_top_comment = 'style="position: relative;left: 0px;top: -87px;width:80px;height:22px;"';
                                yo_mail_top = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -81px;width:180px;height:22px;"';
                                popup_ok_top = 'style="position: relative;left: 692px;top:125px;border: none;width:105px;height:50px;padding: 10px 5px 25px 5px !important;"';
                        } else if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) > 100) {
                                font_size = 'style="font: 15px/1.2 \'Myriad Pro\', sans-serif;position:relative;display:inline;width:510px !Important;height:40px;left:0px;top:0px;word-wrap: break-word;"';
                                yo_name_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -93px;width:180px;height:22px;"';
                                yo_name_top_comment = 'style="position: relative;left: 0px;top: -93px;width:80px;height:22px;"';
                                yo_phone_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -87px;width:180px;height:22px;"';
                                yo_phone_top_comment = 'style="position: relative;left: 0px;top: -87px;width:80px;height:22px;"';
                                yo_mail_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -81px;width:180px;height:22px;"';
                                popup_ok_top = 'style="position: relative;left: 692px;top:125px;border: none;width:105px;height:50px;padding: 10px 5px 25px 5px !important;"';
                        } else {
                                font_size = 'style="font: 16px/1.2 \'Myriad Pro\', sans-serif;position:relative;display:inline;width:490px !Important;height:40px;left:0px;top:0px;word-wrap: break-word;"';
                                yo_name_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -93px;width:180px;height:22px;"';
                                yo_name_top_comment = 'style="position: relative;left: 0px;top: -93px;width:80px;height:22px;"';
                                yo_phone_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -87px;width:180px;height:22px;"';
                                yo_phone_top_comment = 'style="position: relative;left: 0px;top: -87px;width:80px;height:22px;"';
                                yo_mail_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -81px;width:180px;height:22px;"';
                                popup_ok_top = 'style="position: relative;left: 692px;top:125px;border: none;width:105px;height:50px;padding: 10px 5px 25px 5px !important;"';
                        }

                        html += '<div id="fast_order_window_item6" name="fast_order_window_item6"' + font_size + '><b>' + json['item6_1'].toString().trim() + '&nbsp;-&nbsp;' + json['item7_1'].toString().trim() + '&nbsp;' + json['item8_1'].toString().trim() + '</b></div>';
                        html += '</div>';
                        html += '<div class="user_info" style="position:relative;top:25px;left:160px;width:300px;height:80px;">';
                        html += '<input type="text" ' + yo_name_top + ' id="yo_name" name="yo_name" onblur="checkresult_value(this);" value="" placeholder="Имя" pattern="^[\-A-Za-z\u0410-\u044F]+$" maxlength="100"/>&nbsp;<span ' + yo_name_top_comment + '>обязательное поле</span>';
                        html += '<input type="tel" ' + yo_phone_top + ' id="yo_phone" name="yo_phone" onblur="checkresult_value(this);" value="" placeholder="+79101234567" pattern="^[\+0-9]{7,12}$" maxlength="12"/>&nbsp;<span ' + yo_phone_top_comment + '>обязательное поле</span>';
                        html += '<input type="text" ' + yo_mail_top + ' id="yo_mail" name="yo_mail" onblur="checkresult_value(this);" value="" placeholder="ivan@prodacha.ru" pattern="^[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?$" maxlength="100"/>';
                        html += '</div>';
                        html += '<input id="cv3" type="hidden" name="cv3" value="nohspamcode" />';
                        html += '<div class="in_fast_order_window">';
                        html += '<input type="button" ' + popup_ok_top + ' class="popup_ok" id="stihl_ok" value="OK" onclick="check_fast_order_values(2);"/>';
                        //html +=	'<input type="button" '+popup_ok_top+' class="popup_ok" id="fast_order_ok" value="OK" onclick="check_fast_order_values(2);"/>'; //onclick="check_fast_order_values()"
                        html += '</div>';
                        html += '<input type="hidden" id="referer_info" name="referer_info" value="' + referer_info[0].innerHTML.toString().trim() + '" />';
                        html += '<input type="hidden" name="tovar_info_input" value="' + json['item6_1'] + ' - ' + json['item7_1'] + ' ' + json['item8_1'] + '" />';
                        html += '<input type="hidden" name="region" value="' + json['item9_1'] + '" />';
                        html += '<input type="hidden" name="zakaz_info" value="' + json['item1_1'] + '" />';
                        html += '<input type="hidden" name="tovar_price" value="' + json['item7_1'] + ' ' + json['item8_1'] + '" />';
                        html += '<input type="hidden" name="tovar_price_short" value="' + json['item7_1'] + '" />';
                        html += '<input type="hidden" name="tovar_id" value="' + json['item10_2'] + '" />';
                        html += '</form>';
                        html += '<div id="fast_order_window_item11" style="position:relative;display:block;top:-97px;height:20px;">' + json['item11'].toString().trim() + '</div>';
                        
                        if (region_info == 'm') {
                                html += '<div id="stihl_window_moscow_string1">' + json['item7'] + '</div>';
                                html += '<div id="stihl_window_moscow_phone_string1">' + json['item8'] + '</div>';
                                html += '<div id="stihl_window_moscow_string2">' + json['item9'] + '</div>';
                                html += '<div id="stihl_window_moscow_phone_string2">' + json['item10'] + '</div>';
                        } else if (region_info == 'sp') {
                                html += '<div id="stihl_window_spb_string1">' + json['item7'] + '</div>';
                                html += '<div id="stihl_window_spb_phone_string1">' + json['item8'] + '</div>';
                        } else if (region_info == 'chb') {
                                html += '<div id="stihl_window_chb_string1">' + json['item7'] + '</div>';
                                html += '<div id="stihl_window_chb_phone_string1">' + json['item8'] + '</div>';
                        } else if (region_info == 'other') {
                                html += '<div id="stihl_window_other_string1">' + json['item7'] + '</div>';
                                html += '<div id="stihl_window_other_phone_string1">' + json['item8'] + '</div>';
                        }

                        html += '<div id="stihl_window_string4">' + json['item4'] + '</div>';
                        html += '<div id="stihl_window_string5">' + json['item5'] + '</div>';
                        html += '<div id="stihl_window_string6">' + json['item6'] + '</div>';
                        //html +=	'<div class="in_stihl_window">';
                        //html +=	'<input type="button" class="popup_ok" id="stihl_ok" value="OK" onclick="check_fast_order_values(2);"/>';
                        //html +=	'</div>';
                        html += '</div>'; //</div></div>

                                var script = document.createElement("script");
                                script.type = "text/javascript";
                                script.text = "ga('send', 'event', 'kak kupit', 'click');"; // use this for inline script
                                //script.text  += "console.log('kak kupit');";
                                document.body.appendChild(script);
                                // remove from the dom
                                document.body.removeChild(document.body.lastChild);
                                //$('#footer').after(html);
                                var url = 'http://prodacha.ru/ask_product_availability_window.php';
                                $.fancybox
                                ({
                                width : 800,
                                        height : 490,
                                        overlayOpacity:0,
                                        autoSize:false,
                                        type: 'iframe',
                                        href: url,
                                        content: html,
                                        scrolling: 'no',
                                        helpers : {
                                        overlay : {
                                        css : { 'overflow' : 'hidden' }
                                        }}
                                });
                        }
                        }
                });
                        }

    function close_stihl_window() {
        $('#light_box').remove();
    }

                function viking_window(region_info, my_url, referer_info){
                $.ajax({
                url: '/viking_window.php',
                        type: 'post',
                        data: 'reg_info=' + region_info + '&my_url=' + my_url,
                        dataType: 'json',
                        error: function (request, error) {
                        //console.log(arguments);
                        alert(" Ошибка ajax: " + error);
                        },
                        beforeSend: function() {},
                        complete: function() {},
                        success: function(json) {
                        if (json['ok'] == '1'){

                        html = '<div class="stihl_window_iframe">'; //<div id="light_box"><div class="stihl_window"><div class="popup_region">
                        html += '<input type="button" id="stihl_window_close_button" onclick="close_viking_window();"/>';
                        html += '<div id="viking_window_img1"></div>';
                        html += '<div id="stihl_window_string1">' + json['item1'] + '</div>';
                        html += '<div id="stihl_window_img2"></div>';
                        html += '<div id="stihl_window_string2">' + json['item2'] + '</div>';
                        html += '<div id="stihl_window_string3">' + json['item3'] + '</div>';
                        html += '<form id="fast_order_form" action="http://prodacha.ru/snip_call.php" method="POST">';
                        //html +=	'<div id="fast_order_window_item1" style="position:relative;top: 25px;left: 10px;font-size:16px;width:150px;"><b>'+json['item1_1']+'</b></div>';
                        //html +=	'<div id="fast_order_window_item5" style="position:relative;margin-top: 7px;margin-left: 160px;font-size:12px;width:400px;word-wrap: break-word;">'+json['item5_1']+'</div>';
                        html += '<div id="fast_order_window_item2" style="position:relative;top:20px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item2_1'] + '</div>';
                        if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) < 60) {
                            yo_name_top_comment = 20;
                        } else if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) > 100) {
                            yo_name_top_comment = 20;
                        } else {
                            yo_name_top_comment = 20;
                        }
                        //
                        html += '<div id="fast_order_window_item3" style="position:relative;top: ' + (yo_name_top_comment + 20).toString() + 'px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item3_1'] + '</div>';
                        html += '<div id="fast_order_window_item4" style="position:relative;top: ' + (yo_name_top_comment + 30).toString() + 'px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item4_1'] + '</div>';
                        html += '<div id="ask_product_availability_item2" style="position:relative;top: ' + (yo_name_top_comment + 40).toString() + 'px;width:150px;font: 18px/1.2 \'Myriad Pro\', sans-serif;">' + json['item10_1'] + '</div>';
                        html += '<div class="tovar_info" name="tovar_info" style="position:relative;width:530px !Important;height:40px;left:160px;top:-65px;word-wrap: break-word;">';
                        if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) < 60) {
                            font_size = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position:relative;display:inline;width:490px !Important;height:40px;left:0px;top:0px;word-wrap: break-word;"';
                            yo_name_top = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -93px;width:180px;height:22px;"';
                            yo_name_top_comment = 'style="position: relative;left: 0px;top: -93px;width:80px;height:22px;"';
                            yo_phone_top = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -87px;width:180px;height:22px;"';
                            yo_phone_top_comment = 'style="position: relative;left: 0px;top: -87px;width:80px;height:22px;"';
                            yo_mail_top = 'style="font: 17px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -81px;width:180px;height:22px;"';
                            popup_ok_top = 'style="position: relative;left: 692px;top:125px;border: none;width:105px;height:50px;padding: 10px 5px 25px 5px !important;"';
                        } else if ((json['item6_1'].length + json['item7_1'].length + json['item8_1'].length) > 100) {
                            font_size = 'style="font: 15px/1.2 \'Myriad Pro\', sans-serif;position:relative;display:inline;width:510px !Important;height:40px;left:0px;top:0px;word-wrap: break-word;"';
                            yo_name_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -93px;width:180px;height:22px;"';
                            yo_name_top_comment = 'style="position: relative;left: 0px;top: -93px;width:80px;height:22px;"';
                            yo_phone_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -87px;width:180px;height:22px;"';
                            yo_phone_top_comment = 'style="position: relative;left: 0px;top: -87px;width:80px;height:22px;"';
                            yo_mail_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -81px;width:180px;height:22px;"';
                            popup_ok_top = 'style="position: relative;left: 692px;top:125px;border: none;width:105px;height:50px;padding: 10px 5px 25px 5px !important;"';
                        } else {
                            font_size = 'style="font: 16px/1.2 \'Myriad Pro\', sans-serif;position:relative;display:inline;width:490px !Important;height:40px;left:0px;top:0px;word-wrap: break-word;"';
                            yo_name_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -93px;width:180px;height:22px;"';
                            yo_name_top_comment = 'style="position: relative;left: 0px;top: -93px;width:80px;height:22px;"';
                            yo_phone_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -87px;width:180px;height:22px;"';
                            yo_phone_top_comment = 'style="position: relative;left: 0px;top: -87px;width:80px;height:22px;"';
                            yo_mail_top = 'style="font: 18px/1.2 \'Myriad Pro\', sans-serif;position: relative;left: 0px;top: -81px;width:180px;height:22px;"';
                            popup_ok_top = 'style="position: relative;left: 692px;top:125px;border: none;width:105px;height:50px;padding: 10px 5px 25px 5px !important;"';
                        }

                        html += '<div id="fast_order_window_item6" name="fast_order_window_item6"' + font_size + '><b>' + json['item6_1'].toString().trim() + '&nbsp;-&nbsp;' + json['item7_1'].toString().trim() + '&nbsp;' + json['item8_1'].toString().trim() + '</b></div>';
                        html += '</div>';
                        html += '<div class="user_info" style="position:relative;top:25px;left:160px;width:300px;height:80px;">';
                        html += '<input type="text" ' + yo_name_top + ' id="yo_name" name="yo_name" onblur="checkresult_value(this);" value="" placeholder="Имя" pattern="^[\-A-Za-z\u0410-\u044F]+$" maxlength="100"/>&nbsp;<span ' + yo_name_top_comment + '>обязательное поле</span>';
                        html += '<input type="tel" ' + yo_phone_top + ' id="yo_phone" name="yo_phone" onblur="checkresult_value(this);" value="" placeholder="+79101234567" pattern="^[\+0-9]{7,12}$" maxlength="12"/>&nbsp;<span ' + yo_phone_top_comment + '>обязательное поле</span>';
                        html += '<input type="text" ' + yo_mail_top + ' id="yo_mail" name="yo_mail" onblur="checkresult_value(this);" value="" placeholder="ivan@prodacha.ru" pattern="^[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&\'*+\/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?$" maxlength="100"/>';
                        html += '</div>';
                        html += '<input id="cv3" type="hidden" name="cv3" value="nohspamcode" />';
                        html += '<div class="in_fast_order_window">';
                        html += '<input type="button" ' + popup_ok_top + ' class="popup_ok" id="stihl_ok" value="OK" onclick="check_fast_order_values(2);"/>';
                        //html +=	'<input type="button" '+popup_ok_top+' class="popup_ok" id="fast_order_ok" value="OK" onclick="check_fast_order_values(2);"/>'; //onclick="check_fast_order_values()"
                        html += '</div>';
                        html += '<input type="hidden" id="referer_info" name="referer_info" value="' + referer_info[0].innerHTML.toString().trim() + '" />';
                        html += '<input type="hidden" name="tovar_info_input" value="' + json['item6_1'] + ' - ' + json['item7_1'] + ' ' + json['item8_1'] + '" />';
                        html += '<input type="hidden" name="region" value="' + json['item9_1'] + '" />';
                        html += '<input type="hidden" name="zakaz_info" value="' + json['item1_1'] + '" />';
                        html += '<input type="hidden" name="tovar_price" value="' + json['item7_1'] + ' ' + json['item8_1'] + '" />';
                        html += '<input type="hidden" name="tovar_price_short" value="' + json['item7_1'] + '" />';                      
                        html += '<input type="hidden" name="tovar_id" value="' + json['item10_2'] + '" />';
                        html += '</form>';
                        html += '<div id="fast_order_window_item11" style="position:relative;display:block;top:-97px;height:20px;">' + json['item11'].toString().trim() + '</div>';
                        if (region_info == 'm') {
                            html += '<div id="stihl_window_moscow_string1">' + json['item7'] + '</div>';
                            html += '<div id="stihl_window_moscow_phone_string1">' + json['item8'] + '</div>';
                            html += '<div id="stihl_window_moscow_string2">' + json['item9'] + '</div>';
                            html += '<div id="stihl_window_moscow_phone_string2">' + json['item10'] + '</div>';
                        } else if (region_info == 'sp') {
                            html += '<div id="stihl_window_spb_string1">' + json['item7'] + '</div>';
                            html += '<div id="stihl_window_spb_phone_string1">' + json['item8'] + '</div>';
                        } else if (region_info == 'chb') {
                            html += '<div id="stihl_window_chb_string1">' + json['item7'] + '</div>';
                            html += '<div id="stihl_window_chb_phone_string1">' + json['item8'] + '</div>';
                        } else if (region_info == 'other') {
                            html += '<div id="stihl_window_other_string1">' + json['item7'] + '</div>';
                            html += '<div id="stihl_window_other_phone_string1">' + json['item8'] + '</div>';
                        }

                        html += '<div id="stihl_window_string4">' + json['item4'] + '</div>';
                        html += '<div id="stihl_window_string5">' + json['item5'] + '</div>';
                        html += '<div id="stihl_window_string6">' + json['item6'] + '</div>';
                        //html +=	'<div class="in_stihl_window">';
                        //html +=	'<input type="button" class="popup_ok" id="stihl_ok" value="OK" onclick="check_fast_order_values(2);"/>';
                        //html +=	'</div>';
                        html += '</div>'; //</div></div>

                        var script = document.createElement("script");
                        script.type = "text/javascript";
                        script.text = "ga('send', 'event', 'kak kupit', 'click');"; // use this for inline script
                        //script.text  += "console.log('kak kupit');";
                        document.body.appendChild(script);
                        // remove from the dom
                        document.body.removeChild(document.body.lastChild);
                        var url = 'http://prodacha.ru/ask_product_availability_window.php';
                        $.fancybox
                        ({
                        width : 800,
                                height : 490,
                                overlayOpacity:0,
                                autoSize:false,
                                type: 'iframe',
                                href: url,
                                content: html,
                                scrolling: 'no',
                                helpers : {
                                overlay : {
                                css : { 'overflow' : 'hidden' }
                                }}
                        });
                        }
                        }
                });
                        }

    function close_viking_window() {
        $('#light_box').remove();
    }

    function addtochart_window(id){
    $.ajax({
    url: '/popup_windows/addtochart.php',
            type: 'post',
            data: 'xid=' + id,
            dataType: 'json',
            error: function (request, error) {
                console.log(error);
                alert(" Ошибка ajax: " + error);
            },
            beforeSend: function() {},
            complete: function() {},
            success: function(json) {
            if (json['ok'] == '1'){
                if (json['item7']===0){
                    cart_prod_num=1;
                    cart_prod_price=Number(json['item3']);
                } else if (json['item7']>0){
                    cart_prod_num=Number(json['item7']+1);
                    cart_prod_price=Number(json['item8'])+Number(json['item3']);
                }
                
                //console.log(json['item7']);
                //console.log(json['item8']);
                html = '<div class="addtochart_window">';
                html += '<div id="addtochart_window" style="position:relative;top:1px;width:740px;float:left;"><label style="font-size:18px;">Товар добавлен в корзину</label></div>';//background-color:#A0A0A0;
                html += '<div style="position:absolute;clear:both;width:100%;"></div>';
                //html += '<form id="addtochart_form" action="http://prodacha.dev/snip_call.php" method="POST">';
                html += '<div id="product_info_zone_left" style="position: absolute;top:20px;width:480px;height:200px;float:left;">';
                html += '    <div id="product_info" style="position: absolute;margin: 20px 5px 5px 5px;">';
                html += '        <div id="prod_image" name="prod_image" style="position:absolute;display:inline-block;top:1px;width:180px;height:160px;overflow-y:hidden;overflow-x:hidden;"><img src="'+json['item6']+'" alt="'+json['item2']+'" height="160" width="180" style="height:100%;width:100%;"></div>';
                html += '        <div id="prod_name" name="prod_name" style="position:absolute;display:inline;top:15px;left:200px;width:300px;height:35px;font: 15px/1.2 \'Myriad Pro\', sans-serif;">'+json['item2']+'</div>';
                html += '        <div id="prod_price_info" name="prod_price_info" style="position:absolute;display:inline;top:66px;left:200px;width:250px;height:30px;font: 14px/1.2 \'Myriad Pro\', sans-serif;">Цена: <span id="prod_price_info_val" style="font: 16px/1.2 \'Myriad Pro\', sans-serif;font-weight:bold;">'+json['item3']+'</span>&nbsp;'+json['item4']+'</div>';
                html += '        <div id="prod_num_info" style="position:absolute;display:inline;top:100px;left:200px;width:80px;height:30px;font: 14px/1.2 \'Myriad Pro\', sans-serif;">Количество:</div>';
                html += '        <div style="position:absolute;display:inline;top:100px;left:280px;width:160px;height:30px;">';
                html += '        <input type="image" name="edit_del" src="/phpshop/templates/prodacha/images/shop/cart_delete.gif" value="delet" alt="Удалить" width="20" height="20" onclick="ChangeNumProduct2(\'num_new'+id+'\',\'-\');" style="position:absolute;display:inline;vertical-align:middle"/>';
                html += '        <input type="hidden" name="id_delete" value="'+id+'"/>';
                html += '        <input type="text" value="1" size="1" maxlength="3" name="num_new'+id+'" id="num_new'+id+'" onchange="ChangeNumProduct2(\'num_new'+id+'\',\'=\');" style="font: 14px/1.2 \'Myriad Pro\', sans-serif;position:absolute;display:inline;left:20px;"/>';
                html += '        <input type="image" name="edit_num" src="/phpshop/templates/prodacha/images/shop/cart_add.gif" value="edit" width="20" height="20" alt="Пересчитать" hspace="5" onclick="ChangeNumProduct2(\'num_new'+id+'\',\'+\');" style="position:absolute;display:inline;vertical-align:middle;;left:60px;"/>';
                html += '        <input type="hidden" name="id_edit" value="'+id+'"/>';
                html += '        </div>';
                html += '    </div>';
                html += '    <a href="#_tool_'+id+'" id="a_temp_'+id+'" style="position: absolute;top: 185px;border: none;width:175px;height:30px;padding: 5px 5px 25px 5px !important;float:left;font: 16px/1.2 \'Myriad Pro\', sans-serif;" onclick="AddToCartNum('+id+',\'num_new'+id+'\',2)">< Продолжить покупки</a>'; //<!--<a href="#_tool_'+id+'" id="a_temp_'+id+'" style="position: absolute;top: 185px;border: none;width:175px;height:30px;padding: 5px 5px 25px 5px !important;float:left;font: 16px/1.2 \'Myriad Pro\', sans-serif;" onclick="redirect_addtochart_window('+id+');">< Продолжить покупки</a>--> <input type="button" style="position: absolute;top: 185px;border: none;width:175px;height:30px;padding: 5px 5px 25px 5px !important;float:left;font: 16px/1.2 \'Myriad Pro\', sans-serif;" class="ok" id="addtochart_ok" value="< Продолжить покупки" onclick="redirect_addtochart_window('+id+');"/> <a id="a_temp_'+id+'" data-fancybox-href="#_tool_'+id+'" class="fancybox" href="javascript:;" style="position: absolute;top: 185px;border: none;width:175px;height:30px;padding: 5px 5px 25px 5px !important;float:left;font: 16px/1.2 \'Myriad Pro\', sans-serif;">< Продолжить покупки</a>
                html += '</div>';
                html += '<div id="product_info_zone_right" style="position:absolute;width:225px;height:200px;left:530px;top:40px;border-radius:3px;">';//background-color:#A0A0A0;
                html += '    <div id="order_info" style="position: absolute;margin: 20px 5px 5px 5px;">';
                html += '    <div style="padding: 55px 5px 5px 15px;"><label style="font: 16px/1.2 \'Myriad Pro\', sans-serif;"> В корзине: </label><label id="prod_count_label" style="font: 16px/1.2 \'Myriad Pro\', sans-serif;">'+cart_prod_num+'</label>&nbsp;<label id="prod_tovar_label" style="font: 16px/1.2 \'Myriad Pro\', sans-serif;">товар</label>&nbsp;<label style="font: 16px/1.2 \'Myriad Pro\', sans-serif;">на сумму&nbsp;</label><label id="prod_sum_info" style="font: 16px/1.2 \'Myriad Pro\', sans-serif;font-weight:bold;">'+cart_prod_price+'</label><label id="prod_sum_valuta_info" style="font: 16px/1.2 \'Myriad Pro\', sans-serif;">&nbsp;'+json['item4']+'</label>';
                html += '    </div>';
                html += '    <input type="button" style="position: absolute;left: 25px;top: 140px;border: 1px solid black;width:170px;height:30px;padding: 5px 5px 5px 5px !important;font: 16px/1.2 \'Myriad Pro\', sans-serif;font-weight:bold;" class="ok" id="addtochart_ok" value="Перейти в корзину >" onclick="AddToCartNum('+id+',\'num_new'+id+'\',1);"/>';
                html += '    </div>';                            
                html += '</div>';
                html += '    <input id="cv3" type="hidden" name="cv3" value="nohspamcode"/>';
                html += '    <span id="prod_base_price_val" style="visibility:hidden;">'+json['item3']+'</span>';
                html += '    <span id="cart_base_num_val" style="visibility:hidden;">'+json['item7']+'</span>';
                html += '    <span id="cart_base_price_val" style="visibility:hidden;">'+json['item8']+'</span>';
                //html += '</form>';
                html += '</div>';

                //var script = document.createElement("script");
                //script.type = "text/javascript";
                //script.text = "ga('send', 'event', 'kak kupit', 'click');"; // use this for inline script
                //script.text  += "console.log('kak kupit');";
                //document.body.appendChild(script);
                // remove from the dom
                //document.body.removeChild(document.body.lastChild);
                //var url = window.location.href;//'http://prodacha.dev/popup_windows/addtochart_window.php';
                //console.log(window.location.href);
                //href: url,
                /*
                $(".fancybox").fancybox({
                        width : 760,
                        height : 250,
                        overlayOpacity:0,
                        autoSize:false,
                        type: 'iframe',
                        content: html,
                        scrolling: 'no',
                        href: url,
                        helpers : {
                        overlay : {
                        css : { 'overflow' : 'hidden' }
                        }}
                });
                */

                $.fancybox
                ({
                        width : 760,
                        height : 250,
                        overlayOpacity:0,
                        autoSize:false,
                        type: 'iframe',
                        content: html,
                        scrolling: 'no',
                        'afterShow': function() {
                                    //$('body').append('<a href="#_tool_'+id+'" id="a_temp_'+id+'" style="visibility:hidden;"></a>');
                                    //$('.fancybox-item.fancybox-close:eq(0)').prop('href','#_tool_'+id);
                                    //console.log($('.fancybox-item.fancybox-close:eq(0)').attr('title'));
                                },                                    
                        'afterClose': function() {
                                    //console.log(typeof document.getElementById('a_temp_'+id))
                                    //if (typeof document.getElementById('a_temp_'+id)=="object") {
                                    //    document.getElementById('a_temp_'+id).click();                                                    
                                    //}
                                    //$('.fancybox-item.fancybox-close:eq(0)').click

                                },
                        helpers : {
                        overlay : {
                        css : { 'overflow' : 'hidden' }
                        }}
                });
                var cart_prod_num_str=cart_prod_num.toString();

                if (Number(cart_prod_num_str.slice(-1))==1){       
                    document.getElementById('prod_tovar_label').innerHTML='товар';
                }
                if ((Number(cart_prod_num_str.slice(-1))>1 && Number(cart_prod_num_str.slice(-1))<=4)){
                    document.getElementById('prod_tovar_label').innerHTML='товара';
                }
                if (((Number(cart_prod_num_str.slice(-1))>4 && Number(cart_prod_num_str.slice(-1))<=9) || Number(cart_prod_num_str.slice(-1))==0)){
                    document.getElementById('prod_tovar_label').innerHTML='товаров';
                }
                if (Number(cart_prod_num_str)>4 && Number(cart_prod_num_str)<=20){
                    document.getElementById('prod_tovar_label').innerHTML='товаров';
                }
            }
            }
    });
    }

    function close_addtochart_window(){
        $('#light_box').remove();
    }
    function redirect_addtochart_window(id) {
        
        //$('body').append('<a href="#_tool_'+id+'" id="a_temp_'+id+'" style="visibility:hidden;"></a>');
        //$("#a_temp_"+id).click();
        //document.getElementById('a_temp_'+id).click();
/*
        $.fancybox({
        'afterClose': function() { 
            //$('body').append('<a href="#_tool_'+id+'" id="a_temp_'+id+'" style="visibility:hidden;"></a>');
            document.getElementById('a_temp_'+id).click();
        }});
*/
        //location.reload(true);
        
        $.fancybox.close();
        //console.log(window.location.href);
        //document.getElementById('.fancybox-item.fancybox-close').click();
        //$('.fancybox-item.fancybox-close').click()
        //document.getElementById('a_temp_'+id).click();
        //$.fancybox.close();

        //$('.fancybox-item.fancybox-close').click();
        //console.log('#a_temp_'+id);        
        //window.location.href('#_tool_'+id);
        //window.location.replace('#_tool_'+id);
    }
                function check_varranty_firm_city(source) {
                //console.log('check_varranty_firm_city() was called');
                //получаем значение производителя и города для СЦ
                field_vendor_brand = document.getElementById('select_vendor_brand');
                        field_vendor_city = document.getElementById('select_vendor_city');
                        //console.log(field_vendor_brand.options[field_vendor_brand.selectedIndex].text);
                        //console.log(select_vendor_city.options[field_vendor_city.selectedIndex].text);
                        //var jsonstring='field_vendor_brand='+field_vendor_brand.options[field_vendor_brand.selectedIndex].text+'&field_vendor_city='+field_vendor_city.options[field_vendor_city.selectedIndex].text;
                        //активируем ajax запрос чтобы получить новые данные по сервисным центрам
                        var req = new Subsys_JsHttpRequest_Js('windows-1251');
                        req.onreadystatechange = function() {
                        if (req.readyState == 4) {
                        if (req.responseJS) {
                        //document.getElementById('fotoload').innerHTML = (req.responseJS.foto||'');
                        //Удаляем текущий список организаций
                        //$('#select_varranty_firm').remove();
                        //var elem_old = document.getElementById('select_varranty_firm');
                        //elem_old.parentNode.removeChild(elem_old);
                        $('#select_varranty_firm').remove();
                                //добавляем контент
                                //$('#tab6').append(html);
                                if (source == 'sort.hook') {
                        var elem_new = document.getElementById('tab6');
                        } else if (source == 'service.hook') {
                        var elem_new = document.getElementsByClassName('page_content');
                        }
                        //console.log(req.responseJS.result);
                        //result=json2array(req.responseJS.result);
                        //console.log(result);
                        //html=req.responseJS.result;
                        //var arr=jQuery.makeArray(req.responseJS.result);
                        //console.log(result);
                        //for (i=0;i<result.length;i++) {
                        //	html+=//result[i].toString();
                        //console.log(result[i]);					
                        //}

                        //for (i=0;i<parseInt(req.responseJS.cnt);i++) {
                        //	html[i]=req.responseJS.result[i].toString();
                        //console.log(arr[i]);	
                        //}

                        //console.log(html);
                        if (source == 'sort.hook') {
                        $('#tab6').append(req.responseJS.result);
                        } else if (source == 'service.hook') {
                        $('.page_content').append(req.responseJS.result);
                        }
                        //elem_new.insertAdjacentHTML('beforeend', html);                
                        }
                        }
                        }
                req.caching = false;
                        // Подготваливаем объект.
                        // Реальное размещение
                        //console.log(window.location.host);
                        var dir = dirPath();
                        //req.setRequestHeader('Content-type: text/html; charset=windows-1251')
                        req.open('GET', dir + '/phpshop/ajax/varranty_firm_list.php', true);
                        req.send({
                        select_vendor_brand: field_vendor_brand.options[field_vendor_brand.selectedIndex].text,
                                select_vendor_city: select_vendor_city.options[field_vendor_city.selectedIndex].text
                        });
                        /*
                         $.ajax({
                         url: '/phpshop/ajax/varranty_firm_list.php',
                         type: 'post',
                         data: jsonstring,
                         dataType: 'json',
                         //contentType: "text/html; charset=windows-1251",
                         beforeSend: function() {},
                         complete: function() {},		
                         success: function(json) {
                         if (json['ok'] == '1'){
                         for (i=0;i<json.length;i++) {
                         html += json[i];						
                         }
                         
                         //Удаляем текущий список организаций
                         //$('#select_varranty_firm').remove();
                         var elem_old = document.getElementById('select_varranty_firm');
                         elem_old.parentNode.removeChild(elem_old);
                         //добавляем контент со звездами рейтинга в div IMGloader
                         //$('#tab6').append(html);
                         var elem_new = document.getElementById('tab6');
                         elem_new.insertAdjacentHTML('beforeend', html);
                         }
                         }
                         });
                         */
                        }

                function dirPath(){
                ROOT_PATH = "";
                        return ROOT_PATH; //'/'+window.location.host+'/www';
                        }

                function json2array(json){
                var result = [];
                        var keys = Object.keys(json);
                        keys.forEach(function(key){
                        result.push(json[key]);
                        });
                        return result;
                        }